demo/demo.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-07-12 Sun 07:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Dissertation Demos</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Adrian Manea" />
</head>
<body>
<div id="content">
<h1 class="title">Dissertation Demos</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org6ddda66">1. BASIC RACKET</a></li>
<li><a href="#org91c57e2">2. PROUST</a></li>
<li><a href="#orgd99b1fe">3. PIE</a>
<ul>
<li><a href="#orgb30e787">3.1. Basic Syntax</a></li>
<li><a href="#orgc0840fe">3.2. Induction and Dependent Types</a></li>
<li><a href="#orgc464528">3.3. <code>Pair</code> Types and Functions</a>
<ul>
<li><a href="#org43a71a7">3.3.1. Custom <code>Pear</code> Type</a></li>
<li><a href="#orgf4d4d2b">3.3.2. Standard <code>Pair</code> Type</a></li>
</ul>
</li>
<li><a href="#org5c68f52">3.4. <code>List</code> Type and Functions</a>
<ul>
<li><a href="#org2a031dd">3.4.1. Length of a List</a></li>
<li><a href="#org521ae5e">3.4.2. Appending a List to Another List</a></li>
</ul>
</li>
<li><a href="#orge0ff7a9">3.5. Recursor for Product Types</a></li>
<li><a href="#org25a6615">3.6. Coproduct Types</a></li>
<li><a href="#org9b9eb41">3.7. Example: <code>Bool</code></a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org6ddda66" class="outline-2">
<h2 id="org6ddda66"><span class="section-number-2">1</span> BASIC RACKET</h2>
<div class="outline-text-2" id="text-1">
<p>
[[<a href="basics.rkt">   LOCAL FILE</a>  ]]
</p>

<div class="org-src-container">
<pre class="src src-racket"><span style="color: #868686;">;; </span><span style="color: #868686;">Basics on Racket (Appendix)</span>
<span style="color: #000099;">#lang</span> <span style="color: #990000;">racket</span>

<span style="color: #868686;">;; </span><span style="color: #868686;">quote</span>
'<span style="color: #000099;">(</span><span style="color: #000099;">+</span> <span style="color: #006600;">1</span> <span style="color: #006600;">2</span><span style="color: #000099;">)</span>            <span style="color: #868686;">; </span><span style="color: #868686;">=&gt; '(+ 1 2)</span>

<span style="color: #868686;">;; </span><span style="color: #868686;">quasiquote &amp; unquote</span>
<span style="color: #000099;">(</span><span style="color: #000099;">define</span> <span style="color: #990000;">x</span> <span style="color: #006600;">3</span><span style="color: #000099;">)</span>
`<span style="color: #000099;">(</span><span style="color: #000099;">+</span> <span style="color: #006600;">2</span> ,x<span style="color: #000099;">)</span>           <span style="color: #868686;">; </span><span style="color: #868686;">=&gt; '(+ 2 3)</span>
<span style="color: #000099;">(</span><span style="color: #000099;">+</span> <span style="color: #006600;">2</span> x<span style="color: #000099;">)</span>             <span style="color: #868686;">; </span><span style="color: #868686;">=&gt; 5</span>

<span style="color: #868686;">;; </span><span style="color: #868686;">splice unquote</span>
<span style="color: #000099;">(</span><span style="color: #000099;">define</span> <span style="color: #990000;">y</span> '<span style="color: #990000;">(</span><span style="color: #006600;">1</span> <span style="color: #006600;">2</span> <span style="color: #006600;">3</span><span style="color: #990000;">)</span><span style="color: #000099;">)</span>
`<span style="color: #000099;">(</span><span style="color: #000099;">+</span> <span style="color: #006600;">4</span> ,@y<span style="color: #000099;">)</span>          <span style="color: #868686;">; </span><span style="color: #868686;">=&gt; '(+ 4 1 2 3)</span>

<span style="color: #868686;">;; </span><span style="color: #868686;">ERROR</span>
<span style="color: #868686;">;; </span><span style="color: #868686;">(+ 4 y)             ; =&gt; contract violation: + expected number</span>

<span style="color: #868686;">;; </span><span style="color: #868686;">anonymous function via lambda</span>
<span style="color: #000099;">(</span><span style="color: #000099;">define</span> <span style="color: #990000;">(</span><span style="color: #000099;">mod2</span> n<span style="color: #990000;">)</span>
  <span style="color: #990000;">(</span><span style="color: #000000;">(</span><span style="color: #000099;">lambda</span> <span style="color: #006600;">(</span>t<span style="color: #006600;">)</span>
    <span style="color: #006600;">(</span><span style="color: #000099;">remainder</span> t <span style="color: #006600;">2</span><span style="color: #006600;">)</span><span style="color: #000000;">)</span> n<span style="color: #990000;">)</span><span style="color: #000099;">)</span>
<span style="color: #000099;">(</span>mod2 <span style="color: #006600;">3</span><span style="color: #000099;">)</span>                <span style="color: #868686;">; </span><span style="color: #868686;">=&gt; 1</span>

<span style="color: #000099;">(</span><span style="color: #000099;">define</span> <span style="color: #990000;">(</span><span style="color: #000099;">mod3</span> x<span style="color: #990000;">)</span>
  <span style="color: #990000;">(</span><span style="color: #000099;">cond</span>
    <span style="color: #000000;">(</span><span style="color: #006600;">(</span><span style="color: #000099;">equal?</span> <span style="color: #000099;">(</span><span style="color: #000099;">remainder</span> x <span style="color: #006600;">3</span><span style="color: #000099;">)</span> <span style="color: #006600;">1</span><span style="color: #006600;">)</span> <span style="color: #000099;">write</span> <span style="color: #006600;">"it's 1"</span><span style="color: #000000;">)</span>
    <span style="color: #000000;">(</span><span style="color: #006600;">(</span><span style="color: #000099;">equal?</span> <span style="color: #000099;">(</span><span style="color: #000099;">remainder</span> x <span style="color: #006600;">3</span><span style="color: #000099;">)</span> <span style="color: #006600;">2</span><span style="color: #006600;">)</span> <span style="color: #000099;">write</span> <span style="color: #006600;">"it's 2"</span><span style="color: #000000;">)</span>
    <span style="color: #000000;">(</span><span style="color: #006600;">#t</span> <span style="color: #000099;">write</span> <span style="color: #006600;">"it's 0"</span><span style="color: #000000;">)</span><span style="color: #990000;">)</span><span style="color: #000099;">)</span>
<span style="color: #000099;">(</span>mod3 <span style="color: #006600;">5</span><span style="color: #000099;">)</span>                <span style="color: #868686;">; </span><span style="color: #868686;">=&gt; "it's 2"</span>
<span style="color: #000099;">(</span>mod3 <span style="color: #006600;">1</span><span style="color: #000099;">)</span>                <span style="color: #868686;">; </span><span style="color: #868686;">=&gt; "it's 1"</span>
<span style="color: #000099;">(</span>mod3 <span style="color: #006600;">6</span><span style="color: #000099;">)</span>                <span style="color: #868686;">; </span><span style="color: #868686;">=&gt; "it's 0"</span>

<span style="color: #000099;">(</span><span style="color: #000099;">define</span> <span style="color: #990000;">(</span><span style="color: #000099;">add-or-quote</span> x<span style="color: #990000;">)</span>
  <span style="color: #990000;">(</span><span style="color: #000099;">cond</span>
    <span style="color: #000000;">(</span><span style="color: #006600;">(</span><span style="color: #000099;">equal?</span> <span style="color: #000099;">(</span><span style="color: #000099;">remainder</span> x <span style="color: #006600;">2</span><span style="color: #000099;">)</span> <span style="color: #006600;">0</span><span style="color: #006600;">)</span> <span style="color: #006600;">(</span><span style="color: #000099;">(</span><span style="color: #000099;">lambda</span> <span style="color: #990000;">(</span>t<span style="color: #990000;">)</span> <span style="color: #990000;">(</span><span style="color: #000099;">+</span> <span style="color: #006600;">1</span> <span style="color: #006600;">2</span><span style="color: #990000;">)</span><span style="color: #000099;">)</span> x<span style="color: #006600;">)</span><span style="color: #000000;">)</span>
    <span style="color: #000000;">(</span><span style="color: #006600;">#t</span> <span style="color: #006600;">(</span><span style="color: #000099;">(</span><span style="color: #000099;">lambda</span> <span style="color: #990000;">(</span>t<span style="color: #990000;">)</span> <span style="color: #006600;">'hello</span><span style="color: #000099;">)</span> x<span style="color: #006600;">)</span><span style="color: #000000;">)</span><span style="color: #990000;">)</span><span style="color: #000099;">)</span>
<span style="color: #000099;">(</span>add-or-quote <span style="color: #006600;">5</span><span style="color: #000099;">)</span>        <span style="color: #868686;">; </span><span style="color: #868686;">=&gt; 'hello</span>
<span style="color: #000099;">(</span>add-or-quote <span style="color: #006600;">6</span><span style="color: #000099;">)</span>        <span style="color: #868686;">; </span><span style="color: #868686;">=&gt; 3</span>
</pre>
</div>
</div>
</div>
