demo/demo.html

<div id="outline-container-org91c57e2" class="outline-2">
<h2 id="org91c57e2"><span class="section-number-2">2</span> PROUST</h2>
<div class="outline-text-2" id="text-2">
<p>
[[   <a href="proust.rkt">LOCAL FILE</a>  ]]
</p>

<div class="org-src-container">
<pre class="src src-racket"><span style="color: #868686;">;; </span><span style="color: #868686;">P. Ragde -- Proust, a nano proof assistant (2016)</span>
<span style="color: #868686;">;; </span><span style="color: #868686;">Special thanks to the author!</span>

<span style="color: #000099;">#lang</span> <span style="color: #990000;">racket</span>

<span style="color: #000099;">(</span><span style="color: #000099;">struct</span> Lam <span style="color: #990000;">(</span>var body<span style="color: #990000;">)</span> <span style="color: #000099;">#:transparent</span><span style="color: #000099;">)</span>          <span style="color: #868686;">; </span><span style="color: #868686;">lambda abstraction</span>
<span style="color: #000099;">(</span><span style="color: #000099;">struct</span> App <span style="color: #990000;">(</span>func arg<span style="color: #990000;">)</span> <span style="color: #000099;">#:transparent</span><span style="color: #000099;">)</span>          <span style="color: #868686;">; </span><span style="color: #868686;">function application</span>
<span style="color: #000099;">(</span><span style="color: #000099;">struct</span> Ann <span style="color: #990000;">(</span>expr type<span style="color: #990000;">)</span> <span style="color: #000099;">#:transparent</span><span style="color: #000099;">)</span>         <span style="color: #868686;">; </span><span style="color: #868686;">explicit type annotations</span>
<span style="color: #000099;">(</span><span style="color: #000099;">struct</span> Arrow <span style="color: #990000;">(</span>domain codomain<span style="color: #990000;">)</span> <span style="color: #000099;">#:transparent</span><span style="color: #000099;">)</span> <span style="color: #868686;">; </span><span style="color: #868686;">functional types</span>

<span style="color: #868686;">;; </span><span style="color: #868686;">GRAMMAR</span>
<span style="color: #868686;">;; </span><span style="color: #868686;">EXPRESSIONS</span>
<span style="color: #868686;">;; </span><span style="color: #868686;">expr ::= (lambda x =&gt; expr)</span>
<span style="color: #868686;">;;        </span><span style="color: #868686;">| (expr expr)</span>
<span style="color: #868686;">;;        </span><span style="color: #868686;">| (expr : type)</span>
<span style="color: #868686;">;;        </span><span style="color: #868686;">| x (variable)            &lt;------ NO CONSTANTS ALLOWED!</span>
<span style="color: #868686;">;; </span><span style="color: #868686;">TYPES</span>
<span style="color: #868686;">;; </span><span style="color: #868686;">type ::= (type -&gt; type)</span>
<span style="color: #868686;">;;        </span><span style="color: #868686;">| X</span>

<span style="color: #868686;">;; </span><span style="color: #868686;">Parse types</span>
<span style="color: #000099;">(</span><span style="color: #000099;">define</span> <span style="color: #990000;">(</span><span style="color: #000099;">parse-type</span> t<span style="color: #990000;">)</span>
  <span style="color: #990000;">(</span><span style="color: #000099;">match</span> t                                  <span style="color: #868686;">; </span><span style="color: #868686;">pattern match the type</span>
    <span style="color: #000000;">[</span>`<span style="color: #006600;">(</span>,t1 <span style="color: #000099;">-&gt;</span> ,t2<span style="color: #006600;">)</span>                          <span style="color: #868686;">; </span><span style="color: #868686;">is it functional?</span>
     <span style="color: #006600;">(</span>Arrow <span style="color: #000099;">(</span>parse-type t1<span style="color: #000099;">)</span>                 <span style="color: #868686;">; </span><span style="color: #868686;">make it an Arrow</span>
            <span style="color: #000099;">(</span>parse-type t2<span style="color: #000099;">)</span><span style="color: #006600;">)</span><span style="color: #000000;">]</span>
    <span style="color: #000000;">(</span>`<span style="color: #006600;">(</span>,t1 <span style="color: #000099;">-&gt;</span> ,t2 <span style="color: #000099;">-&gt;</span> ,r <span style="color: #000099;">...</span><span style="color: #006600;">)</span>                <span style="color: #868686;">; </span><span style="color: #868686;">is it a multifunc?</span>
     <span style="color: #006600;">(</span>Arrow <span style="color: #000099;">(</span>parse-type t1<span style="color: #000099;">)</span>                 <span style="color: #868686;">; </span><span style="color: #868686;">make it a "multiarrow"</span>
            <span style="color: #000099;">(</span>parse-type `<span style="color: #990000;">(</span>,t1 <span style="color: #000099;">-&gt;</span> ,@r<span style="color: #990000;">)</span><span style="color: #000099;">)</span><span style="color: #006600;">)</span><span style="color: #000000;">)</span>
    <span style="color: #000000;">[</span><span style="color: #006600;">(</span>? <span style="color: #000099;">symbol?</span> X<span style="color: #006600;">)</span> X<span style="color: #000000;">]</span>                       <span style="color: #868686;">; </span><span style="color: #868686;">is it simple? return it</span>
    <span style="color: #000000;">[</span><span style="color: #000099;">else</span> <span style="color: #006600;">(</span><span style="color: #000099;">error</span> <span style="color: #006600;">"can't parse this type"</span><span style="color: #006600;">)</span><span style="color: #000000;">]</span><span style="color: #990000;">)</span><span style="color: #000099;">)</span>

<span style="color: #868686;">;; </span><span style="color: #868686;">Test</span>
<span style="color: #000099;">(</span>parse-type '<span style="color: #990000;">(</span>Int <span style="color: #000099;">-&gt;</span> Nat<span style="color: #990000;">)</span><span style="color: #000099;">)</span>                  <span style="color: #868686;">; </span><span style="color: #868686;">=&gt; (Arrow 'Int 'Nat)</span>
<span style="color: #000099;">(</span>parse-type <span style="color: #006600;">'String</span><span style="color: #000099;">)</span>                        <span style="color: #868686;">; </span><span style="color: #868686;">=&gt; 'String</span>
<span style="color: #000099;">(</span>parse-type '<span style="color: #990000;">(</span>Int <span style="color: #000099;">-&gt;</span> Nat <span style="color: #000099;">-&gt;</span> <span style="color: #000099;">String</span><span style="color: #990000;">)</span><span style="color: #000099;">)</span>        <span style="color: #868686;">; </span><span style="color: #868686;">=&gt; (Arrow 'Int (Arrow 'Int 'String))</span>

<span style="color: #000099;">(</span><span style="color: #000099;">define</span> <span style="color: #990000;">(</span><span style="color: #000099;">parse-expr</span> s<span style="color: #990000;">)</span>
  <span style="color: #990000;">(</span><span style="color: #000099;">match</span> s                              <span style="color: #868686;">; </span><span style="color: #868686;">pattern match the argument</span>
    <span style="color: #000000;">[</span>`<span style="color: #006600;">(</span><span style="color: #000099;">lambda</span> ,<span style="color: #000099;">(</span>? <span style="color: #000099;">symbol?</span> x<span style="color: #000099;">)</span> <span style="color: #000099;">=&gt;</span> ,e<span style="color: #006600;">)</span>     <span style="color: #868686;">; </span><span style="color: #868686;">is it a lambda?</span>
     <span style="color: #006600;">(</span>Lam x <span style="color: #000099;">(</span>parse-expr e<span style="color: #000099;">)</span><span style="color: #006600;">)</span><span style="color: #000000;">]</span>            <span style="color: #868686;">; </span><span style="color: #868686;">make it a Lam</span>
    <span style="color: #000000;">[</span>`<span style="color: #006600;">(</span>,e0 ,e1<span style="color: #006600;">)</span>                         <span style="color: #868686;">; </span><span style="color: #868686;">is it an application?</span>
     <span style="color: #006600;">(</span>App <span style="color: #000099;">(</span>parse-expr e0<span style="color: #000099;">)</span>               <span style="color: #868686;">; </span><span style="color: #868686;">make it an App</span>
          <span style="color: #000099;">(</span>parse-expr e1<span style="color: #000099;">)</span><span style="color: #006600;">)</span><span style="color: #000000;">]</span>
    <span style="color: #000000;">[</span>`<span style="color: #006600;">(</span>,e <span style="color: #000099;">:</span> ,t<span style="color: #006600;">)</span>                         <span style="color: #868686;">; </span><span style="color: #868686;">is it a type annotation (e : t)?</span>
     <span style="color: #006600;">(</span>Ann <span style="color: #000099;">(</span>parse-expr e<span style="color: #000099;">)</span>                <span style="color: #868686;">; </span><span style="color: #868686;">make it an Ann</span>
          <span style="color: #000099;">(</span>parse-type t<span style="color: #000099;">)</span><span style="color: #006600;">)</span><span style="color: #000000;">]</span>
    <span style="color: #000000;">[</span>`<span style="color: #006600;">(</span>,e1 ,e2 ,e3 ,r <span style="color: #000099;">...</span><span style="color: #006600;">)</span>              <span style="color: #868686;">; </span><span style="color: #868686;">is it a general list?</span>
     <span style="color: #006600;">(</span>parse-expr
      `<span style="color: #000099;">(</span><span style="color: #990000;">(</span>,e1 ,e2<span style="color: #990000;">)</span> ,e3 ,@r<span style="color: #000099;">)</span><span style="color: #006600;">)</span><span style="color: #000000;">]</span>            <span style="color: #868686;">; </span><span style="color: #868686;">parse it in pairs</span>
    <span style="color: #000000;">[</span><span style="color: #006600;">(</span>? <span style="color: #000099;">symbol?</span> x<span style="color: #006600;">)</span> x<span style="color: #000000;">]</span>                   <span style="color: #868686;">; </span><span style="color: #868686;">else, it's a symbol, return it</span>
    <span style="color: #000000;">[</span><span style="color: #000099;">else</span> <span style="color: #006600;">(</span><span style="color: #000099;">error</span> <span style="color: #006600;">'parse</span> <span style="color: #006600;">"bad syntax ~a"</span> s<span style="color: #006600;">)</span><span style="color: #000000;">]</span><span style="color: #990000;">)</span><span style="color: #000099;">)</span>       <span style="color: #868686;">; </span><span style="color: #868686;">fail with reason</span>

<span style="color: #868686;">;; </span><span style="color: #868686;">Test</span>
<span style="color: #000099;">(</span>parse-expr '<span style="color: #990000;">(</span>f x<span style="color: #990000;">)</span><span style="color: #000099;">)</span>                     <span style="color: #868686;">; </span><span style="color: #868686;">=&gt; (App 'f 'x)</span>
<span style="color: #000099;">(</span>parse-expr '<span style="color: #990000;">(</span><span style="color: #000099;">lambda</span> x <span style="color: #000099;">=&gt;</span> x<span style="color: #990000;">)</span><span style="color: #000099;">)</span>           <span style="color: #868686;">; </span><span style="color: #868686;">=&gt; (Lam 'x 'x)</span>
<span style="color: #000099;">(</span>parse-expr '<span style="color: #990000;">(</span><span style="color: #000099;">lambda</span> x <span style="color: #000099;">=&gt;</span> <span style="color: #000000;">(</span>x y<span style="color: #000000;">)</span><span style="color: #990000;">)</span><span style="color: #000099;">)</span>       <span style="color: #868686;">; </span><span style="color: #868686;">=&gt; (Lam 'x (App 'x 'y))</span>
<span style="color: #868686;">;; </span><span style="color: #868686;">(parse-expr 3)                          ; =&gt; parse: bad syntax 3     &lt;-- WILL STOP EVALUATION</span>
<span style="color: #000099;">(</span>parse-expr '<span style="color: #990000;">(</span>x <span style="color: #000099;">:</span> Nat<span style="color: #990000;">)</span><span style="color: #000099;">)</span>                 <span style="color: #868686;">; </span><span style="color: #868686;">=&gt; (Ann 'x 'Nat)</span>
<span style="color: #000099;">(</span>parse-expr '<span style="color: #990000;">(</span>x y z t<span style="color: #990000;">)</span><span style="color: #000099;">)</span>                 <span style="color: #868686;">; </span><span style="color: #868686;">=&gt; (App (App (App 'x 'y) 'z) 't)</span>
<span style="color: #000099;">(</span>parse-expr '<span style="color: #990000;">(</span>x <span style="color: #000000;">(</span><span style="color: #000099;">lambda</span> y <span style="color: #000099;">=&gt;</span> <span style="color: #006600;">(</span>z t<span style="color: #006600;">)</span> <span style="color: #006600;">(</span>a <span style="color: #000099;">:</span> Int<span style="color: #006600;">)</span><span style="color: #000000;">)</span><span style="color: #990000;">)</span><span style="color: #000099;">)</span>  <span style="color: #868686;">; </span><span style="color: #868686;">=&gt; (App (App 'x (Lam 'y (App 'z 't))) (Ann 'a 'Int))</span>



<span style="color: #868686;">;; </span><span style="color: #868686;">Pretty printing ("unparsing")</span>
<span style="color: #868686;">;; </span><span style="color: #868686;">pretty-print-expr : expr -&gt; String</span>
<span style="color: #000099;">(</span><span style="color: #000099;">define</span> <span style="color: #990000;">(</span><span style="color: #000099;">pretty-print-expr</span> e<span style="color: #990000;">)</span>
  <span style="color: #990000;">(</span><span style="color: #000099;">match</span> e
    <span style="color: #000000;">[</span><span style="color: #006600;">(</span>Lam x b<span style="color: #006600;">)</span>                                  <span style="color: #868686;">; </span><span style="color: #868686;">lambdas</span>
     <span style="color: #006600;">(</span><span style="color: #000099;">format</span> <span style="color: #006600;">"(lambda ~a =&gt; ~a)"</span> x <span style="color: #000099;">(</span>pretty-print-expr b<span style="color: #000099;">)</span><span style="color: #006600;">)</span><span style="color: #000000;">]</span>
    <span style="color: #000000;">[</span><span style="color: #006600;">(</span>App e1 e2<span style="color: #006600;">)</span>                                <span style="color: #868686;">; </span><span style="color: #868686;">function application</span>
     <span style="color: #006600;">(</span><span style="color: #000099;">format</span> <span style="color: #006600;">"(~a ~a)"</span> <span style="color: #000099;">(</span>pretty-print-expr e1<span style="color: #000099;">)</span> <span style="color: #000099;">(</span>pretty-print-expr e2<span style="color: #000099;">)</span><span style="color: #006600;">)</span><span style="color: #000000;">]</span>
    <span style="color: #000000;">[</span><span style="color: #006600;">(</span>? <span style="color: #000099;">symbol?</span> x<span style="color: #006600;">)</span> <span style="color: #006600;">(</span><span style="color: #000099;">format</span> <span style="color: #006600;">"~a"</span> x<span style="color: #006600;">)</span><span style="color: #000000;">]</span>             <span style="color: #868686;">; </span><span style="color: #868686;">variables</span>
    <span style="color: #000000;">[</span><span style="color: #006600;">(</span>Ann e t<span style="color: #006600;">)</span> <span style="color: #006600;">(</span><span style="color: #000099;">format</span> <span style="color: #006600;">"(~a : ~a)"</span>              <span style="color: #868686;">; </span><span style="color: #868686;">type annotations</span>
                       <span style="color: #000099;">(</span>pretty-print-expr e<span style="color: #000099;">)</span>
                       <span style="color: #000099;">(</span>pretty-print-expr t<span style="color: #000099;">)</span><span style="color: #006600;">)</span><span style="color: #000000;">]</span><span style="color: #990000;">)</span><span style="color: #000099;">)</span>

<span style="color: #868686;">;; </span><span style="color: #868686;">pretty-print-type : Type -&gt; String</span>
<span style="color: #000099;">(</span><span style="color: #000099;">define</span> <span style="color: #990000;">(</span><span style="color: #000099;">pretty-print-type</span> t<span style="color: #990000;">)</span>
  <span style="color: #990000;">(</span><span style="color: #000099;">match</span> t
    <span style="color: #000000;">[</span><span style="color: #006600;">(</span>Arrow t1 t2<span style="color: #006600;">)</span>                              <span style="color: #868686;">; </span><span style="color: #868686;">functional types</span>
     <span style="color: #006600;">(</span><span style="color: #000099;">format</span> <span style="color: #006600;">"(~a -&gt; ~a)"</span>
             <span style="color: #000099;">(</span>pretty-print-type t1<span style="color: #000099;">)</span>
             <span style="color: #000099;">(</span>pretty-print-type t2<span style="color: #000099;">)</span><span style="color: #006600;">)</span><span style="color: #000000;">]</span>
    <span style="color: #000000;">[</span><span style="color: #000099;">else</span> t<span style="color: #000000;">]</span><span style="color: #990000;">)</span><span style="color: #000099;">)</span>                                  <span style="color: #868686;">; </span><span style="color: #868686;">simple types</span>

<span style="color: #868686;">;; </span><span style="color: #868686;">Context = (Listof (List Symbol Type))</span>
<span style="color: #000099;">(</span><span style="color: #000099;">define</span> <span style="color: #990000;">(</span><span style="color: #000099;">pretty-print-context</span> ctx<span style="color: #990000;">)</span>
  <span style="color: #990000;">(</span><span style="color: #000099;">cond</span>
    <span style="color: #000000;">[</span><span style="color: #006600;">(</span><span style="color: #000099;">empty?</span> ctx<span style="color: #006600;">)</span> <span style="color: #006600;">""</span><span style="color: #000000;">]</span>
    <span style="color: #000000;">[</span><span style="color: #000099;">else</span> <span style="color: #006600;">(</span><span style="color: #000099;">string-append</span> <span style="color: #000099;">(</span><span style="color: #000099;">format</span> <span style="color: #006600;">"~a : ~a, "</span>
                                 <span style="color: #990000;">(</span><span style="color: #000099;">first</span> <span style="color: #000000;">(</span><span style="color: #000099;">first</span> ctx<span style="color: #000000;">)</span><span style="color: #990000;">)</span>
                                 <span style="color: #990000;">(</span>pretty-print-type <span style="color: #000000;">(</span><span style="color: #000099;">second</span> <span style="color: #006600;">(</span><span style="color: #000099;">first</span> ctx<span style="color: #006600;">)</span><span style="color: #000000;">)</span><span style="color: #990000;">)</span><span style="color: #000099;">)</span>
                         <span style="color: #000099;">(</span>pretty-print-context <span style="color: #990000;">(</span><span style="color: #000099;">rest</span> ctx<span style="color: #990000;">)</span><span style="color: #000099;">)</span><span style="color: #006600;">)</span><span style="color: #000000;">]</span><span style="color: #990000;">)</span><span style="color: #000099;">)</span>

<span style="color: #868686;">;; </span><span style="color: #868686;">Test</span>
<span style="color: #000099;">(</span>pretty-print-context <span style="color: #990000;">(</span><span style="color: #000099;">list</span> <span style="color: #000000;">(</span><span style="color: #000099;">list</span> <span style="color: #006600;">'x</span> <span style="color: #006600;">'Int</span><span style="color: #000000;">)</span> <span style="color: #000000;">(</span><span style="color: #000099;">list</span> <span style="color: #006600;">'z</span> '<span style="color: #006600;">(</span>A <span style="color: #000099;">-&gt;</span> B<span style="color: #006600;">)</span><span style="color: #000000;">)</span><span style="color: #990000;">)</span><span style="color: #000099;">)</span> <span style="color: #868686;">; </span><span style="color: #868686;">=&gt; "x : Int, z : A -&gt; B"</span>
<span style="color: #000099;">(</span>pretty-print-context <span style="color: #990000;">(</span><span style="color: #000099;">list</span> <span style="color: #000000;">(</span><span style="color: #000099;">list</span> <span style="color: #006600;">'x</span> <span style="color: #006600;">'Int</span><span style="color: #000000;">)</span> <span style="color: #000000;">(</span><span style="color: #000099;">list</span> <span style="color: #006600;">'f</span> <span style="color: #006600;">(</span>pretty-print-expr <span style="color: #000099;">(</span>parse-expr '<span style="color: #990000;">(</span><span style="color: #000099;">lambda</span> z <span style="color: #000099;">=&gt;</span> t<span style="color: #990000;">)</span><span style="color: #000099;">)</span><span style="color: #006600;">)</span><span style="color: #000000;">)</span><span style="color: #990000;">)</span><span style="color: #000099;">)</span>
<span style="color: #868686;">;;                                                         </span><span style="color: #868686;">|_________________|</span>
<span style="color: #868686;">;;                                                           </span><span style="color: #868686;">mutual inverses</span>
<span style="color: #868686;">;; </span><span style="color: #868686;">=&gt; "x : Int, f : (lambda z =&gt; t)"</span>

<span style="color: #868686;">;; </span><span style="color: #868686;">CHECKING LAMBDAS</span>
<span style="color: #868686;">;; </span><span style="color: #868686;">type-check : Context Expr Type -&gt; Boolean</span>
<span style="color: #868686;">;; </span><span style="color: #868686;">produces true if expr has type t in context ctx (else, error)</span>
<span style="color: #000099;">(</span><span style="color: #000099;">define</span> <span style="color: #990000;">(</span><span style="color: #000099;">type-check</span> ctx expr type<span style="color: #990000;">)</span>
  <span style="color: #990000;">(</span><span style="color: #000099;">match</span> expr
    <span style="color: #000000;">[</span><span style="color: #006600;">(</span>Lam x t<span style="color: #006600;">)</span>                      <span style="color: #868686;">; </span><span style="color: #868686;">is it a lambda expression?</span>
     <span style="color: #006600;">(</span><span style="color: #000099;">match</span> type                    <span style="color: #868686;">; </span><span style="color: #868686;">then the type must be an Arrow</span>
       <span style="color: #000099;">[</span><span style="color: #990000;">(</span>Arrow tt tw<span style="color: #990000;">)</span> <span style="color: #990000;">(</span>type-check <span style="color: #000000;">(</span><span style="color: #000099;">cons</span> `<span style="color: #006600;">(</span>,x ,tt<span style="color: #006600;">)</span> ctx<span style="color: #000000;">)</span> t tw<span style="color: #990000;">)</span><span style="color: #000099;">]</span>
       <span style="color: #000099;">[</span><span style="color: #000099;">else</span> <span style="color: #990000;">(</span>cannot-check ctx expr type<span style="color: #990000;">)</span><span style="color: #000099;">]</span><span style="color: #006600;">)</span><span style="color: #000000;">]</span>
    <span style="color: #000000;">[</span><span style="color: #000099;">else</span> <span style="color: #006600;">(</span><span style="color: #000099;">if</span> <span style="color: #000099;">(</span><span style="color: #000099;">equal?</span> <span style="color: #990000;">(</span>type-infer ctx expr<span style="color: #990000;">)</span> type<span style="color: #000099;">)</span> <span style="color: #000099;">true</span>      <span style="color: #868686;">; </span><span style="color: #868686;">fail for any other type</span>
              <span style="color: #000099;">(</span>cannot-check ctx expr type<span style="color: #000099;">)</span><span style="color: #006600;">)</span><span style="color: #000000;">]</span><span style="color: #990000;">)</span><span style="color: #000099;">)</span>

<span style="color: #868686;">;; </span><span style="color: #868686;">the error function</span>
<span style="color: #000099;">(</span><span style="color: #000099;">define</span> <span style="color: #990000;">(</span><span style="color: #000099;">cannot-check</span> ctx expr type<span style="color: #990000;">)</span>
  <span style="color: #990000;">(</span><span style="color: #000099;">error</span> <span style="color: #006600;">'type-check</span> <span style="color: #006600;">"cannot typecheck ~a as ~a in context ~a"</span>
         <span style="color: #000000;">(</span>pretty-print-expr expr<span style="color: #000000;">)</span>
         <span style="color: #000000;">(</span>pretty-print-type type<span style="color: #000000;">)</span>
         <span style="color: #000000;">(</span>pretty-print-context ctx<span style="color: #000000;">)</span><span style="color: #990000;">)</span><span style="color: #000099;">)</span>

<span style="color: #868686;">;; </span><span style="color: #868686;">type-infer : Context Expr -&gt; Type</span>
<span style="color: #868686;">;; </span><span style="color: #868686;">tries to produce type of expr in context ctx (else, error)</span>
<span style="color: #000099;">(</span><span style="color: #000099;">define</span> <span style="color: #990000;">(</span><span style="color: #000099;">type-infer</span> ctx expr<span style="color: #990000;">)</span>
  <span style="color: #990000;">(</span><span style="color: #000099;">match</span> expr
    <span style="color: #000000;">[</span><span style="color: #006600;">(</span>Lam <span style="color: #000099;">_</span> <span style="color: #000099;">_</span><span style="color: #006600;">)</span> <span style="color: #006600;">(</span>cannot-infer ctx expr<span style="color: #006600;">)</span><span style="color: #000000;">]</span>         <span style="color: #868686;">; </span><span style="color: #868686;">lambdas are handled in type-check</span>
    <span style="color: #000000;">[</span><span style="color: #006600;">(</span>Ann e t<span style="color: #006600;">)</span> <span style="color: #006600;">(</span>type-check ctx e t<span style="color: #006600;">)</span> t<span style="color: #000000;">]</span>          <span style="color: #868686;">; </span><span style="color: #868686;">check type annotation</span>
    <span style="color: #000000;">[</span><span style="color: #006600;">(</span>App f a<span style="color: #006600;">)</span>                                  <span style="color: #868686;">; </span><span style="color: #868686;">function application</span>
     <span style="color: #006600;">(</span><span style="color: #000099;">define</span> <span style="color: #990000;">tf</span> <span style="color: #000099;">(</span>type-infer ctx f<span style="color: #000099;">)</span><span style="color: #006600;">)</span>
     <span style="color: #006600;">(</span><span style="color: #000099;">match</span> tf                                  <span style="color: #868686;">; </span><span style="color: #868686;">must be Arrow type</span>
       <span style="color: #000099;">[</span><span style="color: #990000;">(</span>Arrow tt tw<span style="color: #990000;">)</span> <span style="color: #000099;">#:when</span> <span style="color: #990000;">(</span>type-check ctx a tt<span style="color: #990000;">)</span> tw<span style="color: #000099;">]</span>  <span style="color: #868686;">; </span><span style="color: #868686;">when the rest typechecks</span>
       <span style="color: #000099;">[</span><span style="color: #000099;">else</span> <span style="color: #990000;">(</span>cannot-infer ctx expr<span style="color: #990000;">)</span><span style="color: #000099;">]</span><span style="color: #006600;">)</span><span style="color: #000000;">]</span>
    <span style="color: #000000;">[</span><span style="color: #006600;">(</span>? <span style="color: #000099;">symbol?</span> x<span style="color: #006600;">)</span>                              <span style="color: #868686;">; </span><span style="color: #868686;">for symbols</span>
     <span style="color: #006600;">(</span><span style="color: #000099;">cond</span>
       <span style="color: #000099;">[</span><span style="color: #990000;">(</span><span style="color: #000099;">assoc</span> x ctx<span style="color: #990000;">)</span> <span style="color: #000099;">=&gt;</span> <span style="color: #000099;">second</span><span style="color: #000099;">]</span>                <span style="color: #868686;">; </span><span style="color: #868686;">if it's a (ctx) list, the second is the type</span>
       <span style="color: #000099;">[</span><span style="color: #000099;">else</span> <span style="color: #990000;">(</span>cannot-infer ctx expr<span style="color: #990000;">)</span><span style="color: #000099;">]</span><span style="color: #006600;">)</span><span style="color: #000000;">]</span><span style="color: #990000;">)</span><span style="color: #000099;">)</span>       <span style="color: #868686;">; </span><span style="color: #868686;">else, fail</span>

<span style="color: #868686;">;; </span><span style="color: #868686;">the error function</span>
<span style="color: #000099;">(</span><span style="color: #000099;">define</span> <span style="color: #990000;">(</span><span style="color: #000099;">cannot-infer</span> ctx expr<span style="color: #990000;">)</span>
  <span style="color: #990000;">(</span><span style="color: #000099;">error</span> <span style="color: #006600;">'type-infer</span> <span style="color: #006600;">"cannot infer type of ~a in context ~a"</span>
         <span style="color: #000000;">(</span>pretty-print-expr<span style="color: #000000;">)</span>
         <span style="color: #000000;">(</span>pretty-print-context ctx<span style="color: #000000;">)</span><span style="color: #990000;">)</span><span style="color: #000099;">)</span>

<span style="color: #868686;">;; </span><span style="color: #868686;">BASIC TESTING</span>
<span style="color: #000099;">(</span><span style="color: #000099;">require</span> test-engine/racket-tests<span style="color: #000099;">)</span>

<span style="color: #000099;">(</span><span style="color: #000099;">define</span> <span style="color: #990000;">(</span><span style="color: #000099;">check-proof</span> p<span style="color: #990000;">)</span>                         <span style="color: #868686;">; </span><span style="color: #868686;">for empty contexts</span>
  <span style="color: #990000;">(</span>type-infer <span style="color: #000099;">empty</span> <span style="color: #000000;">(</span>parse-expr p<span style="color: #000000;">)</span><span style="color: #990000;">)</span> <span style="color: #000099;">true</span><span style="color: #000099;">)</span>

<span style="color: #868686;">;; </span><span style="color: #868686;">lambda x . x : A -&gt; A</span>
<span style="color: #000099;">(</span>check-expect <span style="color: #990000;">(</span>check-proof '<span style="color: #000000;">(</span><span style="color: #006600;">(</span><span style="color: #000099;">lambda</span> x <span style="color: #000099;">=&gt;</span> x<span style="color: #006600;">)</span> <span style="color: #000099;">:</span> <span style="color: #006600;">(</span>A <span style="color: #000099;">-&gt;</span> A<span style="color: #006600;">)</span><span style="color: #000000;">)</span><span style="color: #990000;">)</span> <span style="color: #000099;">true</span><span style="color: #000099;">)</span>

<span style="color: #868686;">;; </span><span style="color: #868686;">lambda xy.x : A -&gt; (B -&gt; A)</span>
<span style="color: #000099;">(</span>check-expect <span style="color: #990000;">(</span>check-proof '<span style="color: #000000;">(</span><span style="color: #006600;">(</span><span style="color: #000099;">lambda</span> x <span style="color: #000099;">=&gt;</span> <span style="color: #000099;">(</span><span style="color: #000099;">lambda</span> y <span style="color: #000099;">=&gt;</span> x<span style="color: #000099;">)</span><span style="color: #006600;">)</span> <span style="color: #000099;">:</span> <span style="color: #006600;">(</span>A <span style="color: #000099;">-&gt;</span> <span style="color: #000099;">(</span>B <span style="color: #000099;">-&gt;</span> A<span style="color: #000099;">)</span><span style="color: #006600;">)</span><span style="color: #000000;">)</span><span style="color: #990000;">)</span>
              <span style="color: #000099;">true</span><span style="color: #000099;">)</span>

<span style="color: #868686;">;; </span><span style="color: #868686;">lambda xy.yx : (A -&gt; ((A -&gt; B) -&gt; B))</span>
<span style="color: #000099;">(</span>check-expect
 <span style="color: #990000;">(</span>check-proof '<span style="color: #000000;">(</span><span style="color: #006600;">(</span><span style="color: #000099;">lambda</span> x <span style="color: #000099;">=&gt;</span> <span style="color: #000099;">(</span><span style="color: #000099;">lambda</span> y <span style="color: #000099;">=&gt;</span> <span style="color: #990000;">(</span>y x<span style="color: #990000;">)</span><span style="color: #000099;">)</span><span style="color: #006600;">)</span> <span style="color: #000099;">:</span> <span style="color: #006600;">(</span>A <span style="color: #000099;">-&gt;</span> <span style="color: #000099;">(</span><span style="color: #990000;">(</span>A <span style="color: #000099;">-&gt;</span> B<span style="color: #990000;">)</span> <span style="color: #000099;">-&gt;</span> B<span style="color: #000099;">)</span><span style="color: #006600;">)</span><span style="color: #000000;">)</span><span style="color: #990000;">)</span>
 <span style="color: #000099;">true</span><span style="color: #000099;">)</span>

<span style="color: #000099;">(</span>test<span style="color: #000099;">)</span>          <span style="color: #868686;">; </span><span style="color: #868686;">=&gt; All 3 tests passed!</span>
</pre>
</div>
</div>
</div>
