demo/demo.org
* PIE
** Basic Syntax

[[   [[file:pie-basics.rkt][LOCAL FILE]]   ]]

#+BEGIN_SRC racket :tangle pie-basics.rkt :exports code
  #lang pie

  (the (Pair Atom Atom)
	   (cons 'spinach 'cauliflower))
  ;; declares that the cons expression has the specified type

  (claim one Nat)             ; one will be of type Nat
  (define one (add1 zero))    ; zero is primitive
  (the Nat (add1 one))        ; declares that 2 : Nat

  (claim two Nat)
  (define two
	(add1
	 (add1 zero)))
  ;; in REPL:
  ;; > two
  ;; (the Nat two)

  (claim myDogs (Pair Atom Atom))
  (define myDogs (cons 'Ricky 'Rocky))
  ;; in REPL
  ;; > myDogs
  ;; (the (Pair Atom Atom) (cons 'Ricky 'Rocky))

#+END_SRC
** Induction and Dependent Types

[[   [[file:pie-induction.rkt][LOCAL FILE]]   ]]

#+BEGIN_SRC racket :tangle pie-induction.rkt :exports code
  #lang pie

  ;; A couple of the most used "inductive" functions

  ;; (which-Nat target base step)
  ;; - if target is zero => return base
  ;; - else, return (step (- target 1))
  (which-Nat zero
			 'naught
			 (lambda (n) 'more))      ; => (the Atom 'naught)

  (which-Nat 4
			 'naught
			 (lambda (n) 'more))      ; => (the Atom 'more)

  (which-Nat 5
			 0
			 (lambda (n) (add1 7)))   ; => (the Nat 8)


  ;; (iter-Nat target base step)
  ;; - if target is zero => return base;
  ;; - else, target is some (add1 n) and return (step (iter-Nat n base step))

  ;; We will use this to define addition
  ;; First, define the inductive step
  (claim step+ (-> Nat Nat))          ; processes one Nat and returns another
  (define step+
	(lambda (+n-1)
	  (add1 +n-1)))

  ;; Now the addition
  (claim + (-> Nat Nat Nat))          ; addition for the Nat type
  (define +
	(lambda (n j)
	  (iter-Nat n j step+)))


  ;; (rec-Nat target base step)
  ;; - if target is zero, return base;
  ;; - else, target is some (add1 n) and return (step (n (rec-Nat n base step)))
  ;; Example
  (rec-Nat
   (add1 zero)                ; target = 1 => n = 0
   0                          ; base
   (lambda (n-1 almost)       ; step (two-arg function)
	 (add1 (add1 almost))))
  ;; => (the Nat 2)

  ;; Example: Gauss sum
  ;; the inductive step
  (claim step-gauss
		 (-> Nat Nat Nat))
  (define step-gauss
	(lambda (n-1 gauss-n-1)
	  (+ (add1 n-1) gauss-n-1)))

  ;; now the Gauss function
  (claim gauss (-> Nat Nat))
  (define gauss
	(lambda (n)
	  (rec-Nat n
			   0
			   step-gauss)))
  ;; Test
  (gauss 15)                  ; => (the Nat 120)

#+END_SRC
** =Pair= Types and Functions
