demo/demo.html
<div id="outline-container-orgd99b1fe" class="outline-2">
<h2 id="orgd99b1fe"><span class="section-number-2">3</span> PIE</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgb30e787" class="outline-3">
<h3 id="orgb30e787"><span class="section-number-3">3.1</span> Basic Syntax</h3>
<div class="outline-text-3" id="text-3-1">
<p>
[[   <a href="pie-basics.rkt">LOCAL FILE</a>   ]]
</p>

<div class="org-src-container">
<pre class="src src-racket"><span style="color: #000099;">#lang</span> <span style="color: #990000;">pie</span>

<span style="color: #000099;">(</span>the <span style="color: #990000;">(</span><span style="color: #000099;">Pair</span> Atom Atom<span style="color: #990000;">)</span>
     <span style="color: #990000;">(</span><span style="color: #000099;">cons</span> <span style="color: #006600;">'spinach</span> <span style="color: #006600;">'cauliflower</span><span style="color: #990000;">)</span><span style="color: #000099;">)</span>
<span style="color: #868686;">;; </span><span style="color: #868686;">declares that the cons expression has the specified type</span>

<span style="color: #000099;">(</span>claim one Nat<span style="color: #000099;">)</span>             <span style="color: #868686;">; </span><span style="color: #868686;">one will be of type Nat</span>
<span style="color: #000099;">(</span><span style="color: #000099;">define</span> <span style="color: #990000;">one</span> <span style="color: #990000;">(</span><span style="color: #000099;">add1</span> zero<span style="color: #990000;">)</span><span style="color: #000099;">)</span>    <span style="color: #868686;">; </span><span style="color: #868686;">zero is primitive</span>
<span style="color: #000099;">(</span>the Nat <span style="color: #990000;">(</span><span style="color: #000099;">add1</span> one<span style="color: #990000;">)</span><span style="color: #000099;">)</span>        <span style="color: #868686;">; </span><span style="color: #868686;">declares that 2 : Nat</span>

<span style="color: #000099;">(</span>claim two Nat<span style="color: #000099;">)</span>
<span style="color: #000099;">(</span><span style="color: #000099;">define</span> <span style="color: #990000;">two</span>
  <span style="color: #990000;">(</span><span style="color: #000099;">add1</span>
   <span style="color: #000000;">(</span><span style="color: #000099;">add1</span> zero<span style="color: #000000;">)</span><span style="color: #990000;">)</span><span style="color: #000099;">)</span>
<span style="color: #868686;">;; </span><span style="color: #868686;">in REPL:</span>
<span style="color: #868686;">;; </span><span style="color: #868686;">&gt; two</span>
<span style="color: #868686;">;; </span><span style="color: #868686;">(the Nat two)</span>

<span style="color: #000099;">(</span>claim myDogs <span style="color: #990000;">(</span><span style="color: #000099;">Pair</span> Atom Atom<span style="color: #990000;">)</span><span style="color: #000099;">)</span>
<span style="color: #000099;">(</span><span style="color: #000099;">define</span> <span style="color: #990000;">myDogs</span> <span style="color: #990000;">(</span><span style="color: #000099;">cons</span> <span style="color: #006600;">'Ricky</span> <span style="color: #006600;">'Rocky</span><span style="color: #990000;">)</span><span style="color: #000099;">)</span>
<span style="color: #868686;">;; </span><span style="color: #868686;">in REPL</span>
<span style="color: #868686;">;; </span><span style="color: #868686;">&gt; myDogs</span>
<span style="color: #868686;">;; </span><span style="color: #868686;">(the (Pair Atom Atom) (cons 'Ricky 'Rocky))</span>

</pre>
</div>
</div>
</div>
<div id="outline-container-orgc0840fe" class="outline-3">
<h3 id="orgc0840fe"><span class="section-number-3">3.2</span> Induction and Dependent Types</h3>
<div class="outline-text-3" id="text-3-2">
<p>
[[   <a href="pie-induction.rkt">LOCAL FILE</a>   ]]
</p>

<div class="org-src-container">
<pre class="src src-racket"><span style="color: #000099;">#lang</span> <span style="color: #990000;">pie</span>

<span style="color: #868686;">;; </span><span style="color: #868686;">A couple of the most used "inductive" functions</span>

<span style="color: #868686;">;; </span><span style="color: #868686;">(which-Nat target base step)</span>
<span style="color: #868686;">;; </span><span style="color: #868686;">- if target is zero =&gt; return base</span>
<span style="color: #868686;">;; </span><span style="color: #868686;">- else, return (step (- target 1))</span>
<span style="color: #000099;">(</span>which-Nat zero
           <span style="color: #006600;">'naught</span>
           <span style="color: #990000;">(</span><span style="color: #000099;">lambda</span> <span style="color: #000000;">(</span>n<span style="color: #000000;">)</span> <span style="color: #006600;">'more</span><span style="color: #990000;">)</span><span style="color: #000099;">)</span>      <span style="color: #868686;">; </span><span style="color: #868686;">=&gt; (the Atom 'naught)</span>

<span style="color: #000099;">(</span>which-Nat <span style="color: #006600;">4</span>
           <span style="color: #006600;">'naught</span>
           <span style="color: #990000;">(</span><span style="color: #000099;">lambda</span> <span style="color: #000000;">(</span>n<span style="color: #000000;">)</span> <span style="color: #006600;">'more</span><span style="color: #990000;">)</span><span style="color: #000099;">)</span>      <span style="color: #868686;">; </span><span style="color: #868686;">=&gt; (the Atom 'more)</span>

<span style="color: #000099;">(</span>which-Nat <span style="color: #006600;">5</span>
           <span style="color: #006600;">0</span>
           <span style="color: #990000;">(</span><span style="color: #000099;">lambda</span> <span style="color: #000000;">(</span>n<span style="color: #000000;">)</span> <span style="color: #000000;">(</span><span style="color: #000099;">add1</span> <span style="color: #006600;">7</span><span style="color: #000000;">)</span><span style="color: #990000;">)</span><span style="color: #000099;">)</span>   <span style="color: #868686;">; </span><span style="color: #868686;">=&gt; (the Nat 8)</span>


<span style="color: #868686;">;; </span><span style="color: #868686;">(iter-Nat target base step)</span>
<span style="color: #868686;">;; </span><span style="color: #868686;">- if target is zero =&gt; return base;</span>
<span style="color: #868686;">;; </span><span style="color: #868686;">- else, target is some (add1 n) and return (step (iter-Nat n base step))</span>

<span style="color: #868686;">;; </span><span style="color: #868686;">We will use this to define addition</span>
<span style="color: #868686;">;; </span><span style="color: #868686;">First, define the inductive step</span>
<span style="color: #000099;">(</span>claim step+ <span style="color: #990000;">(</span><span style="color: #000099;">-&gt;</span> Nat Nat<span style="color: #990000;">)</span><span style="color: #000099;">)</span>          <span style="color: #868686;">; </span><span style="color: #868686;">processes one Nat and returns another</span>
<span style="color: #000099;">(</span><span style="color: #000099;">define</span> <span style="color: #990000;">step+</span>
  <span style="color: #990000;">(</span><span style="color: #000099;">lambda</span> <span style="color: #000000;">(</span>+n-1<span style="color: #000000;">)</span>
    <span style="color: #000000;">(</span><span style="color: #000099;">add1</span> +n-1<span style="color: #000000;">)</span><span style="color: #990000;">)</span><span style="color: #000099;">)</span>

<span style="color: #868686;">;; </span><span style="color: #868686;">Now the addition</span>
<span style="color: #000099;">(</span>claim <span style="color: #000099;">+</span> <span style="color: #990000;">(</span><span style="color: #000099;">-&gt;</span> Nat Nat Nat<span style="color: #990000;">)</span><span style="color: #000099;">)</span>          <span style="color: #868686;">; </span><span style="color: #868686;">addition for the Nat type</span>
<span style="color: #000099;">(</span><span style="color: #000099;">define</span> <span style="color: #990000;">+</span>
  <span style="color: #990000;">(</span><span style="color: #000099;">lambda</span> <span style="color: #000000;">(</span>n j<span style="color: #000000;">)</span>
    <span style="color: #000000;">(</span>iter-Nat n j step+<span style="color: #000000;">)</span><span style="color: #990000;">)</span><span style="color: #000099;">)</span>


<span style="color: #868686;">;; </span><span style="color: #868686;">(rec-Nat target base step)</span>
<span style="color: #868686;">;; </span><span style="color: #868686;">- if target is zero, return base;</span>
<span style="color: #868686;">;; </span><span style="color: #868686;">- else, target is some (add1 n) and return (step (n (rec-Nat n base step)))</span>
<span style="color: #868686;">;; </span><span style="color: #868686;">Example</span>
<span style="color: #000099;">(</span>rec-Nat
 <span style="color: #990000;">(</span><span style="color: #000099;">add1</span> zero<span style="color: #990000;">)</span>                <span style="color: #868686;">; </span><span style="color: #868686;">target = 1 =&gt; n = 0</span>
 <span style="color: #006600;">0</span>                          <span style="color: #868686;">; </span><span style="color: #868686;">base</span>
 <span style="color: #990000;">(</span><span style="color: #000099;">lambda</span> <span style="color: #000000;">(</span>n-1 almost<span style="color: #000000;">)</span>       <span style="color: #868686;">; </span><span style="color: #868686;">step (two-arg function)</span>
   <span style="color: #000000;">(</span><span style="color: #000099;">add1</span> <span style="color: #006600;">(</span><span style="color: #000099;">add1</span> almost<span style="color: #006600;">)</span><span style="color: #000000;">)</span><span style="color: #990000;">)</span><span style="color: #000099;">)</span>
<span style="color: #868686;">;; </span><span style="color: #868686;">=&gt; (the Nat 2)</span>

<span style="color: #868686;">;; </span><span style="color: #868686;">Example: Gauss sum</span>
<span style="color: #868686;">;; </span><span style="color: #868686;">the inductive step</span>
<span style="color: #000099;">(</span>claim step-gauss
       <span style="color: #990000;">(</span><span style="color: #000099;">-&gt;</span> Nat Nat Nat<span style="color: #990000;">)</span><span style="color: #000099;">)</span>
<span style="color: #000099;">(</span><span style="color: #000099;">define</span> <span style="color: #990000;">step-gauss</span>
  <span style="color: #990000;">(</span><span style="color: #000099;">lambda</span> <span style="color: #000000;">(</span>n-1 gauss-n-1<span style="color: #000000;">)</span>
    <span style="color: #000000;">(</span><span style="color: #000099;">+</span> <span style="color: #006600;">(</span><span style="color: #000099;">add1</span> n-1<span style="color: #006600;">)</span> gauss-n-1<span style="color: #000000;">)</span><span style="color: #990000;">)</span><span style="color: #000099;">)</span>

<span style="color: #868686;">;; </span><span style="color: #868686;">now the Gauss function</span>
<span style="color: #000099;">(</span>claim gauss <span style="color: #990000;">(</span><span style="color: #000099;">-&gt;</span> Nat Nat<span style="color: #990000;">)</span><span style="color: #000099;">)</span>
<span style="color: #000099;">(</span><span style="color: #000099;">define</span> <span style="color: #990000;">gauss</span>
  <span style="color: #990000;">(</span><span style="color: #000099;">lambda</span> <span style="color: #000000;">(</span>n<span style="color: #000000;">)</span>
    <span style="color: #000000;">(</span>rec-Nat n
             <span style="color: #006600;">0</span>
             step-gauss<span style="color: #000000;">)</span><span style="color: #990000;">)</span><span style="color: #000099;">)</span>
<span style="color: #868686;">;; </span><span style="color: #868686;">Test</span>
<span style="color: #000099;">(</span>gauss <span style="color: #006600;">15</span><span style="color: #000099;">)</span>                  <span style="color: #868686;">; </span><span style="color: #868686;">=&gt; (the Nat 120)</span>

</pre>
</div>
</div>
</div>
<div id="outline-container-orgc464528" class="outline-3">
<h3 id="orgc464528"><span class="section-number-3">3.3</span> <code>Pair</code> Types and Functions</h3>
<div class="outline-text-3" id="text-3-3">
</div>
