demo/demo.html
<div id="outline-container-org43a71a7" class="outline-4">
<h4 id="org43a71a7"><span class="section-number-4">3.3.1</span> Custom <code>Pear</code> Type</h4>
<div class="outline-text-4" id="text-3-3-1">
<p>
[[  <a href="pie-pair-types-func.rkt">LOCAL FILE</a>  ]]
</p>

<div class="org-src-container">
<pre class="src src-racket"><span style="color: #000099;">#lang</span> <span style="color: #990000;">pie</span>

<span style="color: #000099;">(</span>claim Pear <span style="color: #000099;">U</span><span style="color: #000099;">)</span>                  <span style="color: #868686;">; </span><span style="color: #868686;">claim the custom type</span>
<span style="color: #000099;">(</span><span style="color: #000099;">define</span> <span style="color: #990000;">Pear</span> <span style="color: #990000;">(</span><span style="color: #000099;">Pair</span> Nat Nat<span style="color: #990000;">)</span><span style="color: #000099;">)</span>    <span style="color: #868686;">; </span><span style="color: #868686;">a Pear is a Pair of two Nats</span>

<span style="color: #000099;">(</span>claim Pear-maker <span style="color: #000099;">U</span><span style="color: #000099;">)</span>            <span style="color: #868686;">; </span><span style="color: #868686;">claim of the type constructor</span>
<span style="color: #000099;">(</span><span style="color: #000099;">define</span> <span style="color: #990000;">Pear-maker</span>              <span style="color: #868686;">; </span><span style="color: #868686;">actual definition</span>
  <span style="color: #990000;">(</span><span style="color: #000099;">-&gt;</span> Nat Nat Pear<span style="color: #990000;">)</span><span style="color: #000099;">)</span>            <span style="color: #868686;">; </span><span style="color: #868686;">Pear-maker : (Nat, Nat) -&gt; Pear</span>

<span style="color: #000099;">(</span>claim elim-Pear
           <span style="color: #990000;">(</span><span style="color: #000099;">-&gt;</span> Pear Pear-maker Pear<span style="color: #990000;">)</span><span style="color: #000099;">)</span>             <span style="color: #868686;">; </span><span style="color: #868686;">claim the type eliminator</span>
<span style="color: #000099;">(</span><span style="color: #000099;">define</span> <span style="color: #990000;">elim-Pear</span>               <span style="color: #868686;">; </span><span style="color: #868686;">the definition of the eliminator</span>
  <span style="color: #990000;">(</span><span style="color: #000099;">lambda</span> <span style="color: #000000;">(</span>pear maker<span style="color: #000000;">)</span>          <span style="color: #868686;">; </span><span style="color: #868686;">is a lambda taking a pear and a maker function</span>
    <span style="color: #000000;">(</span>maker <span style="color: #006600;">(</span><span style="color: #000099;">car</span> pear<span style="color: #006600;">)</span>           <span style="color: #868686;">; </span><span style="color: #868686;">which sends the maker on the first part of the pear</span>
           <span style="color: #006600;">(</span><span style="color: #000099;">cdr</span> pear<span style="color: #006600;">)</span><span style="color: #000000;">)</span><span style="color: #990000;">)</span><span style="color: #000099;">)</span>        <span style="color: #868686;">; </span><span style="color: #868686;">then on the second part</span>


<span style="color: #000099;">(</span><span style="color: #000099;">require</span> <span style="color: #006600;">"addition.rkt"</span><span style="color: #000099;">)</span>        <span style="color: #868686;">; </span><span style="color: #868686;">we need Nat addition (DIY)</span>

<span style="color: #000099;">(</span>claim pearwise+                <span style="color: #868686;">; </span><span style="color: #868686;">claim the addition for this custom type</span>
       <span style="color: #990000;">(</span><span style="color: #000099;">-&gt;</span> Pear Pear Pear<span style="color: #990000;">)</span><span style="color: #000099;">)</span>     <span style="color: #868686;">; </span><span style="color: #868686;">with type (Pear, Pear) -&gt; Pear</span>
<span style="color: #000099;">(</span><span style="color: #000099;">define</span> <span style="color: #990000;">pearwise+</span>               <span style="color: #868686;">; </span><span style="color: #868686;">(a, b) + (c ,d) = (a + c, b + d)</span>
  <span style="color: #990000;">(</span><span style="color: #000099;">lambda</span> <span style="color: #000000;">(</span>x y<span style="color: #000000;">)</span>
    <span style="color: #000000;">(</span>elim-Pear x
               <span style="color: #006600;">(</span><span style="color: #000099;">lambda</span> <span style="color: #000099;">(</span>a1 d1<span style="color: #000099;">)</span>
                 <span style="color: #000099;">(</span>elim-Pear y
                            <span style="color: #990000;">(</span><span style="color: #000099;">lambda</span> a2 d2<span style="color: #990000;">)</span>
                            <span style="color: #990000;">(</span><span style="color: #000099;">cons</span>
                             <span style="color: #000000;">(</span><span style="color: #000099;">+</span> a1 a2<span style="color: #000000;">)</span>
                             <span style="color: #000000;">(</span><span style="color: #000099;">+</span> d1 d2<span style="color: #000000;">)</span><span style="color: #990000;">)</span><span style="color: #000099;">)</span><span style="color: #006600;">)</span><span style="color: #000000;">)</span><span style="color: #990000;">)</span><span style="color: #000099;">)</span>

<span style="color: #000099;">(</span>elim-Pear <span style="color: #990000;">(</span><span style="color: #000099;">cons</span> <span style="color: #006600;">3</span> <span style="color: #006600;">17</span><span style="color: #990000;">)</span>
           <span style="color: #990000;">(</span><span style="color: #000099;">lambda</span> <span style="color: #000000;">(</span>a d<span style="color: #000000;">)</span> <span style="color: #000000;">(</span><span style="color: #000099;">cons</span> d a<span style="color: #000000;">)</span><span style="color: #990000;">)</span><span style="color: #000099;">)</span>
<span style="color: #868686;">;; </span><span style="color: #868686;">=&gt; (the (Pair Nat Nat) (cons 17 3))</span>

<span style="color: #000099;">(</span>pearwise+ <span style="color: #990000;">(</span><span style="color: #000099;">cons</span> <span style="color: #006600;">1</span> <span style="color: #006600;">2</span><span style="color: #990000;">)</span> <span style="color: #990000;">(</span><span style="color: #000099;">cons</span> <span style="color: #006600;">5</span> <span style="color: #006600;">7</span><span style="color: #990000;">)</span><span style="color: #000099;">)</span>
<span style="color: #868686;">;; </span><span style="color: #868686;">=&gt; (the (Pair Nat Nat) (cons 6 9))</span>
</pre>
</div>
</div>
</div>
