demo/demo.html
<div id="outline-container-orgf4d4d2b" class="outline-4">
<h4 id="orgf4d4d2b"><span class="section-number-4">3.3.2</span> Standard <code>Pair</code> Type</h4>
<div class="outline-text-4" id="text-3-3-2">
<p>
[[   <a href="pie-pair-types-func.rkt">LOCAL FILE</a>   ]]
</p>

<div class="org-src-container">
<pre class="src src-racket"><span style="color: #000099;">#lang</span> <span style="color: #990000;">pie</span>

<span style="color: #000099;">(</span>claim elim-Pair                    <span style="color: #868686;">; </span><span style="color: #868686;">"consumer" (eliminator) for Pairs</span>
       <span style="color: #990000;">(</span>Pi <span style="color: #000000;">(</span><span style="color: #006600;">(</span>A <span style="color: #000099;">U</span><span style="color: #006600;">)</span> <span style="color: #006600;">(</span>D <span style="color: #000099;">U</span><span style="color: #006600;">)</span> <span style="color: #006600;">(</span>X <span style="color: #000099;">U</span><span style="color: #006600;">)</span><span style="color: #000000;">)</span>
           <span style="color: #000000;">(</span><span style="color: #000099;">-&gt;</span> <span style="color: #006600;">(</span><span style="color: #000099;">Pair</span> A D<span style="color: #006600;">)</span>
               <span style="color: #006600;">(</span><span style="color: #000099;">-&gt;</span> A D X<span style="color: #006600;">)</span> X<span style="color: #000000;">)</span><span style="color: #990000;">)</span><span style="color: #000099;">)</span>
<span style="color: #000099;">(</span><span style="color: #000099;">define</span> <span style="color: #990000;">elim-Pair</span>
  <span style="color: #990000;">(</span><span style="color: #000099;">lambda</span> <span style="color: #000000;">(</span>A D X<span style="color: #000000;">)</span>                   <span style="color: #868686;">; </span><span style="color: #868686;">abstract the type variables first</span>
    <span style="color: #000000;">(</span><span style="color: #000099;">lambda</span> <span style="color: #006600;">(</span>p f<span style="color: #006600;">)</span>                   <span style="color: #868686;">; </span><span style="color: #868686;">then the rest (f = eliminator, p = pair)</span>
      <span style="color: #006600;">(</span>f <span style="color: #000099;">(</span><span style="color: #000099;">car</span> p<span style="color: #000099;">)</span> <span style="color: #000099;">(</span><span style="color: #000099;">cdr</span> p<span style="color: #000099;">)</span><span style="color: #006600;">)</span><span style="color: #000000;">)</span><span style="color: #990000;">)</span><span style="color: #000099;">)</span>

<span style="color: #000099;">(</span>claim kar                          <span style="color: #868686;">; </span><span style="color: #868686;">DIY car = first</span>
       <span style="color: #990000;">(</span><span style="color: #000099;">-&gt;</span> <span style="color: #000000;">(</span><span style="color: #000099;">Pair</span> Nat Nat<span style="color: #000000;">)</span> Nat<span style="color: #990000;">)</span><span style="color: #000099;">)</span>
<span style="color: #000099;">(</span><span style="color: #000099;">define</span> <span style="color: #990000;">kar</span>
  <span style="color: #990000;">(</span><span style="color: #000099;">lambda</span> <span style="color: #000000;">(</span>p<span style="color: #000000;">)</span>
    <span style="color: #000000;">(</span>elim-Pair Nat Nat Nat p        <span style="color: #868686;">; </span><span style="color: #868686;">make the types concrete</span>
               <span style="color: #006600;">(</span><span style="color: #000099;">lambda</span> <span style="color: #000099;">(</span>a d<span style="color: #000099;">)</span> a<span style="color: #006600;">)</span><span style="color: #000000;">)</span><span style="color: #990000;">)</span><span style="color: #000099;">)</span>  <span style="color: #868686;">; </span><span style="color: #868686;">take first component</span>

<span style="color: #000099;">(</span>claim kdr                          <span style="color: #868686;">; </span><span style="color: #868686;">DIY cdr = second</span>
       <span style="color: #990000;">(</span><span style="color: #000099;">-&gt;</span> <span style="color: #000000;">(</span><span style="color: #000099;">Pair</span> Nat Nat<span style="color: #000000;">)</span> Nat<span style="color: #990000;">)</span><span style="color: #000099;">)</span>
<span style="color: #000099;">(</span><span style="color: #000099;">define</span> <span style="color: #990000;">kdr</span>
  <span style="color: #990000;">(</span><span style="color: #000099;">lambda</span> <span style="color: #000000;">(</span>p<span style="color: #000000;">)</span>
    <span style="color: #000000;">(</span>elim-Pair Nat Nat Nat p        <span style="color: #868686;">; </span><span style="color: #868686;">make the types concrete</span>
               <span style="color: #006600;">(</span><span style="color: #000099;">lambda</span> <span style="color: #000099;">(</span>a d<span style="color: #000099;">)</span> d<span style="color: #006600;">)</span><span style="color: #000000;">)</span><span style="color: #990000;">)</span><span style="color: #000099;">)</span>  <span style="color: #868686;">; </span><span style="color: #868686;">take second component</span>

<span style="color: #868686;">;; </span><span style="color: #868686;">flipping two elements of a Pair</span>
<span style="color: #000099;">(</span>claim flip
       <span style="color: #990000;">(</span>Pi <span style="color: #000000;">(</span><span style="color: #006600;">(</span>A <span style="color: #000099;">U</span><span style="color: #006600;">)</span> <span style="color: #006600;">(</span>D <span style="color: #000099;">U</span><span style="color: #006600;">)</span><span style="color: #000000;">)</span>
           <span style="color: #000000;">(</span><span style="color: #000099;">-&gt;</span> <span style="color: #006600;">(</span><span style="color: #000099;">Pair</span> A D<span style="color: #006600;">)</span> <span style="color: #006600;">(</span><span style="color: #000099;">Pair</span> D A<span style="color: #006600;">)</span><span style="color: #000000;">)</span><span style="color: #990000;">)</span><span style="color: #000099;">)</span>
<span style="color: #000099;">(</span><span style="color: #000099;">define</span> <span style="color: #990000;">flip</span>
  <span style="color: #990000;">(</span><span style="color: #000099;">lambda</span> <span style="color: #000000;">(</span>A D<span style="color: #000000;">)</span>                     <span style="color: #868686;">; </span><span style="color: #868686;">abstract the type variables first</span>
    <span style="color: #000000;">(</span><span style="color: #000099;">lambda</span> <span style="color: #006600;">(</span>p<span style="color: #006600;">)</span>                     <span style="color: #868686;">; </span><span style="color: #868686;">then the pair</span>
      <span style="color: #006600;">(</span><span style="color: #000099;">cons</span> <span style="color: #000099;">(</span><span style="color: #000099;">cdr</span> p<span style="color: #000099;">)</span> <span style="color: #000099;">(</span><span style="color: #000099;">car</span> p<span style="color: #000099;">)</span><span style="color: #006600;">)</span><span style="color: #000000;">)</span><span style="color: #990000;">)</span><span style="color: #000099;">)</span>

<span style="color: #868686;">;; </span><span style="color: #868686;">Examples</span>
<span style="color: #000099;">(</span>kdr <span style="color: #990000;">(</span><span style="color: #000099;">cons</span> <span style="color: #006600;">5</span> <span style="color: #006600;">3</span><span style="color: #990000;">)</span><span style="color: #000099;">)</span>                    <span style="color: #868686;">; </span><span style="color: #868686;">=&gt; (the Nat 3)</span>
<span style="color: #000099;">(</span>kar <span style="color: #990000;">(</span><span style="color: #000099;">cons</span> <span style="color: #006600;">8</span> <span style="color: #006600;">4</span><span style="color: #990000;">)</span><span style="color: #000099;">)</span>                    <span style="color: #868686;">; </span><span style="color: #868686;">=&gt; (the Nat 8)</span>
<span style="color: #000099;">(</span><span style="color: #990000;">(</span>flip Nat Atom<span style="color: #990000;">)</span> <span style="color: #990000;">(</span><span style="color: #000099;">cons</span> <span style="color: #006600;">17</span> <span style="color: #006600;">'apple</span><span style="color: #990000;">)</span><span style="color: #000099;">)</span>  <span style="color: #868686;">; </span><span style="color: #868686;">=&gt; (the (Pair Atom Nat) (cons 'apple 17))</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org5c68f52" class="outline-3">
<h3 id="org5c68f52"><span class="section-number-3">3.4</span> <code>List</code> Type and Functions</h3>
<div class="outline-text-3" id="text-3-4">
</div>
