demo/demo.org
*** Length of a List

[[  [[file:pie-list-length.rkt][LOCAL FILE]]   ]]

#+BEGIN_SRC racket :tangle pie-list-length.rkt :exports code
  #lang pie

  ;; "inductive step" first
  (claim step-length
		 (Pi ((E U))
			 (-> E (List E) Nat Nat)))
  (define step-length
	(lambda (E)                               ; abstract the type first
	  (lambda (e es length-es)                ; then the rest
		(add1 length-es))))                   ; just increase by 1 at each step (see also Gauss)

  (claim length                               ; length of a List
		 (Pi ((E U))                          ; of elements of type E
			 (-> (List E) Nat)))              ; goes from List to Nat
  (define length
	(lambda (E)                               ; abstract the type parameter
	  (lambda (es)                            ; then the actual list
		(rec-List es
				  0
				  (step-length E)))))           ; call the inductive step with this type

  ;; special version for E = Atom
  (claim length-Atom
		 (-> (List Atom) Nat))
  (define length-Atom
	(length Atom))

  ;; Test
  (length Nat (:: 1 (:: 2 (:: 3 nil))))       ; => (the Nat 3)
  (length-Atom (:: 'cat nil))                 ; => (the Nat 1)
  (length-Atom (:: 'cat (:: 'dog nil)))       ; => (the Nat 2)
#+END_SRC

*** Appending a List to Another List

[[   [[file:pie-list-append.rkt][LOCAL FILE]]   ]]

#+BEGIN_SRC racket :tangle pie-list-append.rkt :exports code
  ;; Definining the functions to append to a list,
  ;; using steps and induction, as well as dependent types.
  #lang pie

  ;; the inductive step first
  (claim step-append
		 (Pi ((E U))
			 (-> E (List E) (List E)
				 (List E))))
  (define step-append
	(lambda (E)
	  (lambda (e es append-es)
		(:: e append-es))))

  (claim append
		 (Pi ((E U))
			 (-> (List E) (List E)
				 (List E))))
  (define append
	(lambda (E)
	  (lambda (start end)
		(rec-List start
				  end
				  (step-append E)))))

  ;; Test
  (append Nat (:: 5 nil) (:: 3 nil))  ; => (the (List Nat) (:: 5 (:: 3 nil)))
#+END_SRC
