demo/demo.html
<div id="outline-container-org2a031dd" class="outline-4">
<h4 id="org2a031dd"><span class="section-number-4">3.4.1</span> Length of a List</h4>
<div class="outline-text-4" id="text-3-4-1">
<p>
[[  <a href="pie-list-length.rkt">LOCAL FILE</a>   ]]
</p>

<div class="org-src-container">
<pre class="src src-racket"><span style="color: #000099;">#lang</span> <span style="color: #990000;">pie</span>

<span style="color: #868686;">;; </span><span style="color: #868686;">"inductive step" first</span>
<span style="color: #000099;">(</span>claim step-length
       <span style="color: #990000;">(</span>Pi <span style="color: #000000;">(</span><span style="color: #006600;">(</span>E <span style="color: #000099;">U</span><span style="color: #006600;">)</span><span style="color: #000000;">)</span>
           <span style="color: #000000;">(</span><span style="color: #000099;">-&gt;</span> E <span style="color: #006600;">(</span><span style="color: #000099;">List</span> E<span style="color: #006600;">)</span> Nat Nat<span style="color: #000000;">)</span><span style="color: #990000;">)</span><span style="color: #000099;">)</span>
<span style="color: #000099;">(</span><span style="color: #000099;">define</span> <span style="color: #990000;">step-length</span>
  <span style="color: #990000;">(</span><span style="color: #000099;">lambda</span> <span style="color: #000000;">(</span>E<span style="color: #000000;">)</span>                               <span style="color: #868686;">; </span><span style="color: #868686;">abstract the type first</span>
    <span style="color: #000000;">(</span><span style="color: #000099;">lambda</span> <span style="color: #006600;">(</span>e es length-es<span style="color: #006600;">)</span>                <span style="color: #868686;">; </span><span style="color: #868686;">then the rest</span>
      <span style="color: #006600;">(</span><span style="color: #000099;">add1</span> length-es<span style="color: #006600;">)</span><span style="color: #000000;">)</span><span style="color: #990000;">)</span><span style="color: #000099;">)</span>                   <span style="color: #868686;">; </span><span style="color: #868686;">just increase by 1 at each step (see also Gauss)</span>

<span style="color: #000099;">(</span>claim <span style="color: #000099;">length</span>                               <span style="color: #868686;">; </span><span style="color: #868686;">length of a List</span>
       <span style="color: #990000;">(</span>Pi <span style="color: #000000;">(</span><span style="color: #006600;">(</span>E <span style="color: #000099;">U</span><span style="color: #006600;">)</span><span style="color: #000000;">)</span>                          <span style="color: #868686;">; </span><span style="color: #868686;">of elements of type E</span>
           <span style="color: #000000;">(</span><span style="color: #000099;">-&gt;</span> <span style="color: #006600;">(</span><span style="color: #000099;">List</span> E<span style="color: #006600;">)</span> Nat<span style="color: #000000;">)</span><span style="color: #990000;">)</span><span style="color: #000099;">)</span>              <span style="color: #868686;">; </span><span style="color: #868686;">goes from List to Nat</span>
<span style="color: #000099;">(</span><span style="color: #000099;">define</span> <span style="color: #990000;">length</span>
  <span style="color: #990000;">(</span><span style="color: #000099;">lambda</span> <span style="color: #000000;">(</span>E<span style="color: #000000;">)</span>                               <span style="color: #868686;">; </span><span style="color: #868686;">abstract the type parameter</span>
    <span style="color: #000000;">(</span><span style="color: #000099;">lambda</span> <span style="color: #006600;">(</span>es<span style="color: #006600;">)</span>                            <span style="color: #868686;">; </span><span style="color: #868686;">then the actual list</span>
      <span style="color: #006600;">(</span>rec-List es
                <span style="color: #006600;">0</span>
                <span style="color: #000099;">(</span>step-length E<span style="color: #000099;">)</span><span style="color: #006600;">)</span><span style="color: #000000;">)</span><span style="color: #990000;">)</span><span style="color: #000099;">)</span>           <span style="color: #868686;">; </span><span style="color: #868686;">call the inductive step with this type</span>

<span style="color: #868686;">;; </span><span style="color: #868686;">special version for E = Atom</span>
<span style="color: #000099;">(</span>claim length-Atom
       <span style="color: #990000;">(</span><span style="color: #000099;">-&gt;</span> <span style="color: #000000;">(</span><span style="color: #000099;">List</span> Atom<span style="color: #000000;">)</span> Nat<span style="color: #990000;">)</span><span style="color: #000099;">)</span>
<span style="color: #000099;">(</span><span style="color: #000099;">define</span> <span style="color: #990000;">length-Atom</span>
  <span style="color: #990000;">(</span><span style="color: #000099;">length</span> Atom<span style="color: #990000;">)</span><span style="color: #000099;">)</span>

<span style="color: #868686;">;; </span><span style="color: #868686;">Test</span>
<span style="color: #000099;">(</span><span style="color: #000099;">length</span> Nat <span style="color: #990000;">(</span>:: <span style="color: #006600;">1</span> <span style="color: #000000;">(</span>:: <span style="color: #006600;">2</span> <span style="color: #006600;">(</span>:: <span style="color: #006600;">3</span> nil<span style="color: #006600;">)</span><span style="color: #000000;">)</span><span style="color: #990000;">)</span><span style="color: #000099;">)</span>       <span style="color: #868686;">; </span><span style="color: #868686;">=&gt; (the Nat 3)</span>
<span style="color: #000099;">(</span>length-Atom <span style="color: #990000;">(</span>:: <span style="color: #006600;">'cat</span> nil<span style="color: #990000;">)</span><span style="color: #000099;">)</span>                 <span style="color: #868686;">; </span><span style="color: #868686;">=&gt; (the Nat 1)</span>
<span style="color: #000099;">(</span>length-Atom <span style="color: #990000;">(</span>:: <span style="color: #006600;">'cat</span> <span style="color: #000000;">(</span>:: <span style="color: #006600;">'dog</span> nil<span style="color: #000000;">)</span><span style="color: #990000;">)</span><span style="color: #000099;">)</span>       <span style="color: #868686;">; </span><span style="color: #868686;">=&gt; (the Nat 2)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org521ae5e" class="outline-4">
<h4 id="org521ae5e"><span class="section-number-4">3.4.2</span> Appending a List to Another List</h4>
<div class="outline-text-4" id="text-3-4-2">
<p>
[[   <a href="pie-list-append.rkt">LOCAL FILE</a>   ]]
</p>

<div class="org-src-container">
<pre class="src src-racket"><span style="color: #868686;">;; </span><span style="color: #868686;">Definining the functions to append to a list,</span>
<span style="color: #868686;">;; </span><span style="color: #868686;">using steps and induction, as well as dependent types.</span>
<span style="color: #000099;">#lang</span> <span style="color: #990000;">pie</span>

<span style="color: #868686;">;; </span><span style="color: #868686;">the inductive step first</span>
<span style="color: #000099;">(</span>claim step-append
       <span style="color: #990000;">(</span>Pi <span style="color: #000000;">(</span><span style="color: #006600;">(</span>E <span style="color: #000099;">U</span><span style="color: #006600;">)</span><span style="color: #000000;">)</span>
           <span style="color: #000000;">(</span><span style="color: #000099;">-&gt;</span> E <span style="color: #006600;">(</span><span style="color: #000099;">List</span> E<span style="color: #006600;">)</span> <span style="color: #006600;">(</span><span style="color: #000099;">List</span> E<span style="color: #006600;">)</span>
               <span style="color: #006600;">(</span><span style="color: #000099;">List</span> E<span style="color: #006600;">)</span><span style="color: #000000;">)</span><span style="color: #990000;">)</span><span style="color: #000099;">)</span>
<span style="color: #000099;">(</span><span style="color: #000099;">define</span> <span style="color: #990000;">step-append</span>
  <span style="color: #990000;">(</span><span style="color: #000099;">lambda</span> <span style="color: #000000;">(</span>E<span style="color: #000000;">)</span>
    <span style="color: #000000;">(</span><span style="color: #000099;">lambda</span> <span style="color: #006600;">(</span>e es append-es<span style="color: #006600;">)</span>
      <span style="color: #006600;">(</span>:: e append-es<span style="color: #006600;">)</span><span style="color: #000000;">)</span><span style="color: #990000;">)</span><span style="color: #000099;">)</span>

<span style="color: #000099;">(</span>claim <span style="color: #000099;">append</span>
       <span style="color: #990000;">(</span>Pi <span style="color: #000000;">(</span><span style="color: #006600;">(</span>E <span style="color: #000099;">U</span><span style="color: #006600;">)</span><span style="color: #000000;">)</span>
           <span style="color: #000000;">(</span><span style="color: #000099;">-&gt;</span> <span style="color: #006600;">(</span><span style="color: #000099;">List</span> E<span style="color: #006600;">)</span> <span style="color: #006600;">(</span><span style="color: #000099;">List</span> E<span style="color: #006600;">)</span>
               <span style="color: #006600;">(</span><span style="color: #000099;">List</span> E<span style="color: #006600;">)</span><span style="color: #000000;">)</span><span style="color: #990000;">)</span><span style="color: #000099;">)</span>
<span style="color: #000099;">(</span><span style="color: #000099;">define</span> <span style="color: #990000;">append</span>
  <span style="color: #990000;">(</span><span style="color: #000099;">lambda</span> <span style="color: #000000;">(</span>E<span style="color: #000000;">)</span>
    <span style="color: #000000;">(</span><span style="color: #000099;">lambda</span> <span style="color: #006600;">(</span>start end<span style="color: #006600;">)</span>
      <span style="color: #006600;">(</span>rec-List start
                end
                <span style="color: #000099;">(</span>step-append E<span style="color: #000099;">)</span><span style="color: #006600;">)</span><span style="color: #000000;">)</span><span style="color: #990000;">)</span><span style="color: #000099;">)</span>

<span style="color: #868686;">;; </span><span style="color: #868686;">Test</span>
<span style="color: #000099;">(</span><span style="color: #000099;">append</span> Nat <span style="color: #990000;">(</span>:: <span style="color: #006600;">5</span> nil<span style="color: #990000;">)</span> <span style="color: #990000;">(</span>:: <span style="color: #006600;">3</span> nil<span style="color: #990000;">)</span><span style="color: #000099;">)</span>  <span style="color: #868686;">; </span><span style="color: #868686;">=&gt; (the (List Nat) (:: 5 (:: 3 nil)))</span>
</pre>
</div>
</div>
</div>
</div>
