demo/demo.html
<div id="outline-container-orge0ff7a9" class="outline-3">
<h3 id="orge0ff7a9"><span class="section-number-3">3.5</span> Recursor for Product Types</h3>
<div class="outline-text-3" id="text-3-5">
<p>
[[   <a href="hott-recursor.rkt">LOCAL FILE</a>   ]]
</p>

<div class="org-src-container">
<pre class="src src-racket"><span style="color: #868686;">;; </span><span style="color: #868686;">The recursor rec_(A x B) from the HoTT book.</span>
<span style="color: #868686;">;; </span><span style="color: #868686;">rec_(A x B) : (Pi_(C : U) (A -&gt; B -&gt; C)) -&gt; (A x B) -&gt; C</span>
<span style="color: #868686;">;; </span><span style="color: #868686;">rec_(A x B) (C, g, (a, b)) := g(a)(b)</span>

<span style="color: #000099;">#lang</span> <span style="color: #990000;">pie</span>

<span style="color: #000099;">(</span>claim recAxB
       <span style="color: #990000;">(</span>Pi <span style="color: #000000;">(</span><span style="color: #006600;">(</span>A <span style="color: #000099;">U</span><span style="color: #006600;">)</span> <span style="color: #006600;">(</span>B <span style="color: #000099;">U</span><span style="color: #006600;">)</span> <span style="color: #006600;">(</span>C <span style="color: #000099;">U</span><span style="color: #006600;">)</span><span style="color: #000000;">)</span>
           <span style="color: #000000;">(</span><span style="color: #000099;">-&gt;</span> <span style="color: #006600;">(</span><span style="color: #000099;">-&gt;</span> A B C<span style="color: #006600;">)</span> <span style="color: #006600;">(</span><span style="color: #000099;">Pair</span> A B<span style="color: #006600;">)</span> C<span style="color: #000000;">)</span><span style="color: #990000;">)</span><span style="color: #000099;">)</span>

<span style="color: #000099;">(</span><span style="color: #000099;">define</span> <span style="color: #990000;">recAxB</span>
  <span style="color: #990000;">(</span><span style="color: #000099;">lambda</span> <span style="color: #000000;">(</span>A B C<span style="color: #000000;">)</span>
    <span style="color: #000000;">(</span><span style="color: #000099;">lambda</span> <span style="color: #006600;">(</span>g p<span style="color: #006600;">)</span>
      <span style="color: #006600;">(</span><span style="color: #000099;">(</span>g <span style="color: #990000;">(</span><span style="color: #000099;">car</span> p<span style="color: #990000;">)</span><span style="color: #000099;">)</span> <span style="color: #000099;">(</span><span style="color: #000099;">cdr</span> p<span style="color: #000099;">)</span><span style="color: #006600;">)</span><span style="color: #000000;">)</span><span style="color: #990000;">)</span><span style="color: #000099;">)</span>

<span style="color: #868686;">;; </span><span style="color: #868686;">example</span>
<span style="color: #000099;">(</span><span style="color: #990000;">(</span>recAxB Nat Nat Nat<span style="color: #990000;">)</span> <span style="color: #990000;">(</span><span style="color: #000099;">lambda</span> <span style="color: #000000;">(</span>x y<span style="color: #000000;">)</span> <span style="color: #000000;">(</span><span style="color: #000099;">add1</span> y<span style="color: #000000;">)</span><span style="color: #990000;">)</span> <span style="color: #990000;">(</span><span style="color: #000099;">cons</span> <span style="color: #006600;">2</span> <span style="color: #006600;">3</span><span style="color: #990000;">)</span><span style="color: #000099;">)</span>       <span style="color: #868686;">;; </span><span style="color: #868686;">=&gt; (the Nat 4)</span>

<span style="color: #868686;">;; </span><span style="color: #868686;">first projection</span>
<span style="color: #000099;">(</span><span style="color: #990000;">(</span>recAxB Nat Nat Nat<span style="color: #990000;">)</span> <span style="color: #990000;">(</span><span style="color: #000099;">lambda</span> <span style="color: #000000;">(</span>x y<span style="color: #000000;">)</span> x<span style="color: #990000;">)</span> <span style="color: #990000;">(</span><span style="color: #000099;">cons</span> <span style="color: #006600;">2</span> <span style="color: #006600;">3</span><span style="color: #990000;">)</span><span style="color: #000099;">)</span>              <span style="color: #868686;">;; </span><span style="color: #868686;">=&gt; (the Nat 4)</span>

<span style="color: #868686;">;; </span><span style="color: #868686;">defined generally, for Nat type</span>
<span style="color: #000099;">(</span>claim p1 <span style="color: #990000;">(</span><span style="color: #000099;">-&gt;</span> <span style="color: #000000;">(</span><span style="color: #000099;">Pair</span> Nat Nat<span style="color: #000000;">)</span> Nat<span style="color: #990000;">)</span><span style="color: #000099;">)</span>
<span style="color: #000099;">(</span><span style="color: #000099;">define</span> <span style="color: #990000;">p1</span>
  <span style="color: #990000;">(</span><span style="color: #000000;">(</span>recAxB Nat Nat Nat<span style="color: #000000;">)</span>
   <span style="color: #000000;">(</span><span style="color: #000099;">lambda</span> <span style="color: #006600;">(</span>x y<span style="color: #006600;">)</span> x<span style="color: #000000;">)</span><span style="color: #990000;">)</span><span style="color: #000099;">)</span>

<span style="color: #868686;">;; </span><span style="color: #868686;">test</span>
<span style="color: #000099;">(</span>p1 <span style="color: #990000;">(</span><span style="color: #000099;">cons</span> <span style="color: #006600;">2</span> <span style="color: #006600;">3</span><span style="color: #990000;">)</span><span style="color: #000099;">)</span>                                                 <span style="color: #868686;">;; </span><span style="color: #868686;">=&gt; (the Nat 2)</span>


<span style="color: #868686;">;; </span><span style="color: #868686;">for unit type (Atom hack)</span>
<span style="color: #000099;">(</span>claim recA
       <span style="color: #990000;">(</span>Pi <span style="color: #000000;">(</span><span style="color: #006600;">(</span>C <span style="color: #000099;">U</span><span style="color: #006600;">)</span><span style="color: #000000;">)</span> <span style="color: #000000;">(</span><span style="color: #000099;">-&gt;</span> C Atom C<span style="color: #000000;">)</span><span style="color: #990000;">)</span><span style="color: #000099;">)</span>
<span style="color: #000099;">(</span><span style="color: #000099;">define</span> <span style="color: #990000;">recA</span>
  <span style="color: #990000;">(</span><span style="color: #000099;">lambda</span> <span style="color: #000000;">(</span>C<span style="color: #000000;">)</span>
    <span style="color: #000000;">(</span><span style="color: #000099;">lambda</span> <span style="color: #006600;">(</span>c atom<span style="color: #006600;">)</span>
      c<span style="color: #000000;">)</span><span style="color: #990000;">)</span><span style="color: #000099;">)</span>

<span style="color: #868686;">;; </span><span style="color: #868686;">test</span>
<span style="color: #000099;">(</span><span style="color: #990000;">(</span>recA Nat<span style="color: #990000;">)</span> zero <span style="color: #006600;">'something</span><span style="color: #000099;">)</span>                                    <span style="color: #868686;">;; </span><span style="color: #868686;">=&gt; (the Nat 0)</span>

<span style="color: #868686;">;; </span><span style="color: #868686;">for unit type</span>
<span style="color: #000099;">(</span>claim recU
       <span style="color: #990000;">(</span>Pi <span style="color: #000000;">(</span><span style="color: #006600;">(</span>C <span style="color: #000099;">U</span><span style="color: #006600;">)</span><span style="color: #000000;">)</span> <span style="color: #000000;">(</span><span style="color: #000099;">-&gt;</span> C Trivial C<span style="color: #000000;">)</span><span style="color: #990000;">)</span><span style="color: #000099;">)</span>
<span style="color: #000099;">(</span><span style="color: #000099;">define</span> <span style="color: #990000;">recU</span>
  <span style="color: #990000;">(</span><span style="color: #000099;">lambda</span> <span style="color: #000000;">(</span>C<span style="color: #000000;">)</span>
    <span style="color: #000000;">(</span><span style="color: #000099;">lambda</span> <span style="color: #006600;">(</span>c d<span style="color: #006600;">)</span>       <span style="color: #868686;">;; </span><span style="color: #868686;">d can only be sole</span>
      c<span style="color: #000000;">)</span><span style="color: #990000;">)</span><span style="color: #000099;">)</span>

<span style="color: #868686;">;; </span><span style="color: #868686;">test</span>
<span style="color: #000099;">(</span><span style="color: #990000;">(</span>recU Trivial<span style="color: #990000;">)</span> sole sole<span style="color: #000099;">)</span>                                      <span style="color: #868686;">;; </span><span style="color: #868686;">=&gt; (the Trivial sole)</span>
</pre>
</div>
</div>
</div>
