demo/demo.org
** Coproduct Types

[[   [[file:hott-coproduct.rkt][LOCAL FILE]]   ]]

#+BEGIN_SRC racket :tangle hott-coproduct.rkt :exports code
  #lang pie

  (claim recA+B
		 (Pi ((A U) (B U) (C U))
			 (-> (-> A C) (-> B C) (Either A B) C)))

  (define recA+B
	(lambda (A B C)
	  (lambda (g0 g1 tgt)
		(ind-Either tgt
					(lambda (_) C)                ; motive
					(lambda (x) (g0 x))           ; the left case
					(lambda (y) (g1 y))))))       ; the right case


  ;; test
  ((recA+B Nat Nat Nat)
   (lambda (x) (add1 x))
   (lambda (y) zero)
   (left 3))                                      ; => (the Nat 4)

  ((recA+B Nat Nat Nat)
   (lambda (x) (add1 x))
   (lambda (y) zero)
   (right 3))                                     ; => (the Nat 0)
#+END_SRC

** Example: =Bool=

[[   [[file:hott-bool.rkt][LOCAL FILE]]   ]]

#+BEGIN_SRC racket :tangle hott-bool.rkt :exports code
  #lang pie

  ;; shortcuts
  (claim Bool U)
  (define Bool (Either Trivial Trivial))
  (claim true Bool)
  (define true (left sole))
  (claim false Bool)
  (define false (right sole))

  ;; Bool recursor = if (branching)
  (claim if
		 (Pi ((A U))
			 (-> Bool A A A)))
  (define if
	(lambda (A tgt t f)
	  (ind-Either tgt
				  (lambda (_) A)                  ; motive
				  (lambda (_) t)                  ; the true case
				  (lambda (_) f))))               ; the false case

  ;; REMARK: t != true and f != false
  ;; t is the instruction when tgt == true
  ;; f is the instruction when tgt == false

  ;; test
  (if Nat true zero 1)            ; => (the Nat 0)
  (if Nat false zero 1)           ; => (the Nat 1)

  ;; unfolded test
  (if Nat (left sole) zero 1)     ; => (the Nat 0)
  (if Nat (right sole) zero 1)    ; => (the Nat 1)
#+END_SRC
