demo/demo.html

<div id="outline-container-org25a6615" class="outline-3">
<h3 id="org25a6615"><span class="section-number-3">3.6</span> Coproduct Types</h3>
<div class="outline-text-3" id="text-3-6">
<p>
[[   <a href="hott-coproduct.rkt">LOCAL FILE</a>   ]]
</p>

<div class="org-src-container">
<pre class="src src-racket"><span style="color: #000099;">#lang</span> <span style="color: #990000;">pie</span>

<span style="color: #000099;">(</span>claim recA+B
       <span style="color: #990000;">(</span>Pi <span style="color: #000000;">(</span><span style="color: #006600;">(</span>A <span style="color: #000099;">U</span><span style="color: #006600;">)</span> <span style="color: #006600;">(</span>B <span style="color: #000099;">U</span><span style="color: #006600;">)</span> <span style="color: #006600;">(</span>C <span style="color: #000099;">U</span><span style="color: #006600;">)</span><span style="color: #000000;">)</span>
           <span style="color: #000000;">(</span><span style="color: #000099;">-&gt;</span> <span style="color: #006600;">(</span><span style="color: #000099;">-&gt;</span> A C<span style="color: #006600;">)</span> <span style="color: #006600;">(</span><span style="color: #000099;">-&gt;</span> B C<span style="color: #006600;">)</span> <span style="color: #006600;">(</span>Either A B<span style="color: #006600;">)</span> C<span style="color: #000000;">)</span><span style="color: #990000;">)</span><span style="color: #000099;">)</span>

<span style="color: #000099;">(</span><span style="color: #000099;">define</span> <span style="color: #990000;">recA+B</span>
  <span style="color: #990000;">(</span><span style="color: #000099;">lambda</span> <span style="color: #000000;">(</span>A B C<span style="color: #000000;">)</span>
    <span style="color: #000000;">(</span><span style="color: #000099;">lambda</span> <span style="color: #006600;">(</span>g0 g1 tgt<span style="color: #006600;">)</span>
      <span style="color: #006600;">(</span>ind-Either tgt
                  <span style="color: #000099;">(</span><span style="color: #000099;">lambda</span> <span style="color: #990000;">(</span><span style="color: #000099;">_</span><span style="color: #990000;">)</span> C<span style="color: #000099;">)</span>                <span style="color: #868686;">; </span><span style="color: #868686;">motive</span>
                  <span style="color: #000099;">(</span><span style="color: #000099;">lambda</span> <span style="color: #990000;">(</span>x<span style="color: #990000;">)</span> <span style="color: #990000;">(</span>g0 x<span style="color: #990000;">)</span><span style="color: #000099;">)</span>           <span style="color: #868686;">; </span><span style="color: #868686;">the left case</span>
                  <span style="color: #000099;">(</span><span style="color: #000099;">lambda</span> <span style="color: #990000;">(</span>y<span style="color: #990000;">)</span> <span style="color: #990000;">(</span>g1 y<span style="color: #990000;">)</span><span style="color: #000099;">)</span><span style="color: #006600;">)</span><span style="color: #000000;">)</span><span style="color: #990000;">)</span><span style="color: #000099;">)</span>       <span style="color: #868686;">; </span><span style="color: #868686;">the right case</span>


<span style="color: #868686;">;; </span><span style="color: #868686;">test</span>
<span style="color: #000099;">(</span><span style="color: #990000;">(</span>recA+B Nat Nat Nat<span style="color: #990000;">)</span>
 <span style="color: #990000;">(</span><span style="color: #000099;">lambda</span> <span style="color: #000000;">(</span>x<span style="color: #000000;">)</span> <span style="color: #000000;">(</span><span style="color: #000099;">add1</span> x<span style="color: #000000;">)</span><span style="color: #990000;">)</span>
 <span style="color: #990000;">(</span><span style="color: #000099;">lambda</span> <span style="color: #000000;">(</span>y<span style="color: #000000;">)</span> zero<span style="color: #990000;">)</span>
 <span style="color: #990000;">(</span>left <span style="color: #006600;">3</span><span style="color: #990000;">)</span><span style="color: #000099;">)</span>                                      <span style="color: #868686;">; </span><span style="color: #868686;">=&gt; (the Nat 4)</span>

<span style="color: #000099;">(</span><span style="color: #990000;">(</span>recA+B Nat Nat Nat<span style="color: #990000;">)</span>
 <span style="color: #990000;">(</span><span style="color: #000099;">lambda</span> <span style="color: #000000;">(</span>x<span style="color: #000000;">)</span> <span style="color: #000000;">(</span><span style="color: #000099;">add1</span> x<span style="color: #000000;">)</span><span style="color: #990000;">)</span>
 <span style="color: #990000;">(</span><span style="color: #000099;">lambda</span> <span style="color: #000000;">(</span>y<span style="color: #000000;">)</span> zero<span style="color: #990000;">)</span>
 <span style="color: #990000;">(</span>right <span style="color: #006600;">3</span><span style="color: #990000;">)</span><span style="color: #000099;">)</span>                                     <span style="color: #868686;">; </span><span style="color: #868686;">=&gt; (the Nat 0)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org9b9eb41" class="outline-3">
<h3 id="org9b9eb41"><span class="section-number-3">3.7</span> Example: <code>Bool</code></h3>
<div class="outline-text-3" id="text-3-7">
<p>
[[   <a href="hott-bool.rkt">LOCAL FILE</a>   ]]
</p>

<div class="org-src-container">
<pre class="src src-racket"><span style="color: #000099;">#lang</span> <span style="color: #990000;">pie</span>

<span style="color: #868686;">;; </span><span style="color: #868686;">shortcuts</span>
<span style="color: #000099;">(</span>claim Bool <span style="color: #000099;">U</span><span style="color: #000099;">)</span>
<span style="color: #000099;">(</span><span style="color: #000099;">define</span> <span style="color: #990000;">Bool</span> <span style="color: #990000;">(</span>Either Trivial Trivial<span style="color: #990000;">)</span><span style="color: #000099;">)</span>
<span style="color: #000099;">(</span>claim <span style="color: #000099;">true</span> Bool<span style="color: #000099;">)</span>
<span style="color: #000099;">(</span><span style="color: #000099;">define</span> <span style="color: #990000;">true</span> <span style="color: #990000;">(</span>left sole<span style="color: #990000;">)</span><span style="color: #000099;">)</span>
<span style="color: #000099;">(</span>claim <span style="color: #000099;">false</span> Bool<span style="color: #000099;">)</span>
<span style="color: #000099;">(</span><span style="color: #000099;">define</span> <span style="color: #990000;">false</span> <span style="color: #990000;">(</span>right sole<span style="color: #990000;">)</span><span style="color: #000099;">)</span>

<span style="color: #868686;">;; </span><span style="color: #868686;">Bool recursor = if (branching)</span>
<span style="color: #000099;">(</span>claim <span style="color: #000099;">if</span>
       <span style="color: #990000;">(</span>Pi <span style="color: #000000;">(</span><span style="color: #006600;">(</span>A <span style="color: #000099;">U</span><span style="color: #006600;">)</span><span style="color: #000000;">)</span>
           <span style="color: #000000;">(</span><span style="color: #000099;">-&gt;</span> Bool A A A<span style="color: #000000;">)</span><span style="color: #990000;">)</span><span style="color: #000099;">)</span>
<span style="color: #000099;">(</span><span style="color: #000099;">define</span> <span style="color: #990000;">if</span>
  <span style="color: #990000;">(</span><span style="color: #000099;">lambda</span> <span style="color: #000000;">(</span>A tgt t f<span style="color: #000000;">)</span>
    <span style="color: #000000;">(</span>ind-Either tgt
                <span style="color: #006600;">(</span><span style="color: #000099;">lambda</span> <span style="color: #000099;">(</span><span style="color: #000099;">_</span><span style="color: #000099;">)</span> A<span style="color: #006600;">)</span>                  <span style="color: #868686;">; </span><span style="color: #868686;">motive</span>
                <span style="color: #006600;">(</span><span style="color: #000099;">lambda</span> <span style="color: #000099;">(</span><span style="color: #000099;">_</span><span style="color: #000099;">)</span> t<span style="color: #006600;">)</span>                  <span style="color: #868686;">; </span><span style="color: #868686;">the true case</span>
                <span style="color: #006600;">(</span><span style="color: #000099;">lambda</span> <span style="color: #000099;">(</span><span style="color: #000099;">_</span><span style="color: #000099;">)</span> f<span style="color: #006600;">)</span><span style="color: #000000;">)</span><span style="color: #990000;">)</span><span style="color: #000099;">)</span>               <span style="color: #868686;">; </span><span style="color: #868686;">the false case</span>

<span style="color: #868686;">;; </span><span style="color: #868686;">REMARK: t != true and f != false</span>
<span style="color: #868686;">;; </span><span style="color: #868686;">t is the instruction when tgt == true</span>
<span style="color: #868686;">;; </span><span style="color: #868686;">f is the instruction when tgt == false</span>

<span style="color: #868686;">;; </span><span style="color: #868686;">test</span>
<span style="color: #000099;">(</span><span style="color: #000099;">if</span> Nat <span style="color: #000099;">true</span> zero <span style="color: #006600;">1</span><span style="color: #000099;">)</span>            <span style="color: #868686;">; </span><span style="color: #868686;">=&gt; (the Nat 0)</span>
<span style="color: #000099;">(</span><span style="color: #000099;">if</span> Nat <span style="color: #000099;">false</span> zero <span style="color: #006600;">1</span><span style="color: #000099;">)</span>           <span style="color: #868686;">; </span><span style="color: #868686;">=&gt; (the Nat 1)</span>

<span style="color: #868686;">;; </span><span style="color: #868686;">unfolded test</span>
<span style="color: #000099;">(</span><span style="color: #000099;">if</span> Nat <span style="color: #990000;">(</span>left sole<span style="color: #990000;">)</span> zero <span style="color: #006600;">1</span><span style="color: #000099;">)</span>     <span style="color: #868686;">; </span><span style="color: #868686;">=&gt; (the Nat 0)</span>
<span style="color: #000099;">(</span><span style="color: #000099;">if</span> Nat <span style="color: #990000;">(</span>right sole<span style="color: #990000;">)</span> zero <span style="color: #006600;">1</span><span style="color: #000099;">)</span>    <span style="color: #868686;">; </span><span style="color: #868686;">=&gt; (the Nat 1)</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Adrian Manea</p>
<p class="date">Created: 2020-07-12 Sun 07:28</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
